{
  "threshold": 0.9,
  "within_topic": {
    "total_pairs": 0,
    "pairs": []
  },
  "cross_topic": {
    "total_pairs": 4,
    "pairs": [
      {
        "topic1": "networking",
        "topic2": "troubleshooting",
        "file1": "networking.json",
        "file2": "troubleshooting.json",
        "index1": 29,
        "index2": 9,
        "similarity": 0.9969040247678018,
        "same_answers": true,
        "q1_text": "A technician is troubleshooting a laptop that is unable to browse the internet when connected to the company’s wireless network. The technician has verified\nnetwork connectivity is functional when using an Ethernet cable. Which of the following should the technician use to check if the laptop's wireless NIC is functional?",
        "q2_text": "A technician is troubleshooting a laptop that is unable to browse the internet when connected to the company’s wireless network. The technician has verified network connectivity is functional when using an Ethernet cable. Which of the following should the technician use to check if the laptop's wireless NIC is functional?",
        "q1_correct": [
          0
        ],
        "q2_correct": [
          0
        ]
      },
      {
        "topic1": "hardware",
        "topic2": "troubleshooting",
        "file1": "hardware.json",
        "file2": "troubleshooting.json",
        "index1": 49,
        "index2": 5,
        "similarity": 0.9952456418383518,
        "same_answers": true,
        "q1_text": "A technician receives several error alerts on a server after an unexpected reboot. A message states that one or more disks are in a degraded state. When the\ntechnician advances to the next error message, it indicates the OS is missing. Which of the following are the MOST likely causes of these errors? (Choose two.)",
        "q2_text": "A technician receives several error alerts on a server after an unexpected reboot. A message states that one or more disks are in a degraded state. When the technician advances to the next error message, it indicates the OS is missing. Which of the following are the MOST likely causes of these errors? (Choose TWO)",
        "q1_correct": [
          1,
          2
        ],
        "q2_correct": [
          1,
          2
        ]
      },
      {
        "topic1": "networking",
        "topic2": "troubleshooting",
        "file1": "networking.json",
        "file2": "troubleshooting.json",
        "index1": 30,
        "index2": 41,
        "similarity": 0.9928741092636579,
        "same_answers": true,
        "q1_text": "A technician needs to fix a Cat 5 cable issue. The cable, which is connected to a network jack, fails when it is moved around. Which of the following items must the\ntechnician use to fix the issue? (Select TWO).",
        "q2_text": "A technician needs to fix a Cat 5 cable issue. The cable, which is connected to a network jack, fails when it is moved around. Which of the following items must the technician use to fix the issue? (Select TWO)",
        "q1_correct": [
          4,
          5
        ],
        "q2_correct": [
          4,
          5
        ]
      },
      {
        "topic1": "virtualization-cloud",
        "topic2": "miscellaneous",
        "file1": "virtualization-cloud.json",
        "file2": "miscellaneous.json",
        "index1": 1,
        "index2": 2,
        "similarity": 0.9910233393177738,
        "same_answers": true,
        "q1_text": "A developer is requesting permission to utilize client-side virtualization. The developer would like to write code in a setting isolated from other infrastructure to avoid negative impacts of experimental code. Which of the following provides the BEST solution for the developer?",
        "q2_text": "A developer is requesting permission to utilize client-side visualization. The developer would like to write code in a setting isolated from other infrastructure to avoid\nnegative impacts of experimental code. Which of the following provides the BEST solution for the developer?",
        "q1_correct": [
          3
        ],
        "q2_correct": [
          3
        ]
      }
    ]
  }
}