{
  "threshold": 0.9,
  "total_pairs": 25,
  "pairs": [
    {
      "index1": 34,
      "index2": 36,
      "similarity": 1.0,
      "same_answers": true,
      "q1_text": "A user connects a smartphone to a laptop. Which of the following types of networks has the user created?",
      "q2_text": "A user connects a smartphone to a laptop. Which of the following types of networks has the user created?",
      "q1_correct": [
        0
      ],
      "q2_correct": [
        0
      ],
      "topic": "mobile-devices",
      "filename": "mobile-devices.json"
    },
    {
      "index1": 16,
      "index2": 38,
      "similarity": 1.0,
      "same_answers": true,
      "q1_text": "An insurance company wants to implement cloud computing and would like a cloud solution in which the infrastructure is shared with businesses in the same\nindustry. Which of the following cloud models BEST addresses the company's need?",
      "q2_text": "An insurance company wants to implement cloud computing and would like a cloud solution in which the infrastructure is shared with businesses in the same\nindustry. Which of the following cloud models BEST addresses the company's need?",
      "q1_correct": [
        0
      ],
      "q2_correct": [
        0
      ],
      "topic": "networking",
      "filename": "networking.json"
    },
    {
      "index1": 41,
      "index2": 60,
      "similarity": 1.0,
      "same_answers": true,
      "q1_text": "A technician configured a new SOHO router for a small business. The ISP gave the technician an IP address on the router's WAN port. Which of the following\naddresses did the technician most likely configure on the router?",
      "q2_text": "A technician configured a new SOHO router for a small business. The ISP gave the technician an IP address on the router's WAN port. Which of the following\naddresses did the technician most likely configure on the router?",
      "q1_correct": [
        1
      ],
      "q2_correct": [
        1
      ],
      "topic": "networking",
      "filename": "networking.json"
    },
    {
      "index1": 4,
      "index2": 8,
      "similarity": 1.0,
      "same_answers": true,
      "q1_text": "Which of the following would an administrator use to migrate virtual machines from on premises to the cloud?",
      "q2_text": "Which of the following would an administrator use to migrate virtual machines from on premises to the cloud?",
      "q1_correct": [
        0
      ],
      "q2_correct": [
        0
      ],
      "topic": "virtualization-cloud",
      "filename": "virtualization-cloud.json"
    },
    {
      "index1": 2,
      "index2": 24,
      "similarity": 0.9980806142034548,
      "same_answers": true,
      "q1_text": "A salesperson is using a weather application on a mobile device. The application appears to be draining the device's battery very quickly. Which of the following is\nthe BEST action for the salesperson to take in order to view weather forecasts while traveling?",
      "q2_text": "A salesperson is using a weather application on a mobile device. The application appears to be draining the device's battery very quickly. Which of the following is\nthe BEST action for the salesperson to take in order to view weather forecasts while travelling?",
      "q1_correct": [
        2
      ],
      "q2_correct": [
        2
      ],
      "topic": "mobile-devices",
      "filename": "mobile-devices.json"
    },
    {
      "index1": 3,
      "index2": 13,
      "similarity": 0.9964028776978417,
      "same_answers": true,
      "q1_text": "Several users who share a multifunction printer in an office have reported unintended, thin, vertical lines that cover the entire height of every page printed from the printer. Which of the following steps should a technician complete in order to MOST likely resolve this issue?",
      "q2_text": "Several users who share a multifunction printer in an office have reported unintended, thin, vertical lines that cover the entire height of every page printed from the\nprinter. Which of the following steps should a technician complete in order to MOST likely resolve this issue?",
      "q1_correct": [
        3
      ],
      "q2_correct": [
        3
      ],
      "topic": "troubleshooting",
      "filename": "troubleshooting.json"
    },
    {
      "index1": 63,
      "index2": 69,
      "similarity": 0.9964028776978417,
      "same_answers": true,
      "q1_text": "A technician is receiving reports that the entire office sporadically loses network connectivity throughout the day. The technician determines the root cause to be EMI. Which of the following cable mediums would be the MOST cost effective without sacrificing system performance?",
      "q2_text": "A technician is receiving reports that the entire office sporadically loses network connectivity throughout the day. The technician determines the root cause to be\nEMI. Which of the following cable mediums would be the MOST cost effective without sacrificing system performance?",
      "q1_correct": [
        1
      ],
      "q2_correct": [
        1
      ],
      "topic": "troubleshooting",
      "filename": "troubleshooting.json"
    },
    {
      "index1": 32,
      "index2": 90,
      "similarity": 0.9963235294117647,
      "same_answers": true,
      "q1_text": "A technician is configuring a new CAD workstation that has four large hard drives. The workstation will be used to edit large, critical files, so the storage configuration should be both fast and redundant. Which of the following RAID levels BEST meets these requirements?",
      "q2_text": "A technician is configuring a new CAD workstation that has four large hard drives. The workstation will be used to edit large, critical files, so the storage\nconfiguration should be both fast and redundant. Which of the following RAID levels BEST meets these requirements?",
      "q1_correct": [
        2
      ],
      "q2_correct": [
        2
      ],
      "topic": "hardware",
      "filename": "hardware.json"
    },
    {
      "index1": 100,
      "index2": 105,
      "similarity": 0.9959349593495935,
      "same_answers": true,
      "q1_text": "A technician is upgrading a legacy wireless router for a home user. After installing the new router and configuring the SSID to be the same, none of the devices will\nconnect to the network. Which of the following should the technician check NEXT?",
      "q2_text": "A technician is upgrading a legacy wireless router for a home user. After installing the new router and configuring the SSID to be the same, none of the devices will connect to the network. Which of the following should the technician check NEXT?",
      "q1_correct": [
        1
      ],
      "q2_correct": [
        1
      ],
      "topic": "troubleshooting",
      "filename": "troubleshooting.json"
    },
    {
      "index1": 72,
      "index2": 148,
      "similarity": 0.995850622406639,
      "same_answers": true,
      "q1_text": "A Microsoft Windows user is preparing to work in another country and needs to comply with corporate policy for data protection when copying files to portable media. Which of the following solutions would MOST likely satisfy this requirement?",
      "q2_text": "A Microsoft Windows user is preparing to work in another country and needs to comply with corporate policy for data protection when copying files to portable\nmedia. Which of the following solutions would MOST likely satisfy this requirement?",
      "q1_correct": [
        0
      ],
      "q2_correct": [
        0
      ],
      "topic": "troubleshooting",
      "filename": "troubleshooting.json"
    },
    {
      "index1": 45,
      "index2": 116,
      "similarity": 0.9955555555555555,
      "same_answers": true,
      "q1_text": "A field technician has been dispatched to a site with an internet outage. Upon arriving, the technician discovers that the POTS lines are not working as well. Which of the following technologies is the site MOST likely using?",
      "q2_text": "A field technician has been dispatched to a site with an internet outage. Upon arriving, the technician discovers that the POTS lines are not working as well. Which\nof the following technologies is the site MOST likely using?",
      "q1_correct": [
        2
      ],
      "q2_correct": [
        2
      ],
      "topic": "troubleshooting",
      "filename": "troubleshooting.json"
    },
    {
      "index1": 11,
      "index2": 21,
      "similarity": 0.994535519125683,
      "same_answers": true,
      "q1_text": "A technician is attempting to connect the wired LANs at two nearby buildings by installing a wireless point-to-point connection. Which of the following should the\ntechnician consider?",
      "q2_text": "A technician is attempting to connect the wired LANs at two nearby buildings by installing a wireless point-to-point connection. Which of the following should the technician consider?",
      "q1_correct": [
        3
      ],
      "q2_correct": [
        3
      ],
      "topic": "networking",
      "filename": "networking.json"
    },
    {
      "index1": 0,
      "index2": 20,
      "similarity": 0.9941690962099126,
      "same_answers": true,
      "q1_text": "A startup company is outgrowing its current office space and is requiring employees to work remotely. The company must comply with government-enforced requirements to safeguard all aspects of data, so the IT department plans to maintain complete control over users' operating systems. Which of the following should the IT department implement?",
      "q2_text": "A startup company is outgrowing its current office space and is requiring employees to work remotely. The company must comply with government-enforced\nrequirements to safeguard all aspects of data, so the IT department plans to maintain complete control over users' operating systems. Which of the following\nshould the IT department implement?",
      "q1_correct": [
        0
      ],
      "q2_correct": [
        0
      ],
      "topic": "virtualization-cloud",
      "filename": "virtualization-cloud.json"
    },
    {
      "index1": 10,
      "index2": 30,
      "similarity": 0.9940828402366864,
      "same_answers": true,
      "q1_text": "A technician is troubleshooting a classroom projector that shuts down after fifteen minutes of use. Which of the following should the technician do to resolve the issue?",
      "q2_text": "A technician is troubleshooting a classroom projector that shuts down after fifteen minutes of use. Which of the following should the technician do to resolve the\nissue?",
      "q1_correct": [
        2
      ],
      "q2_correct": [
        2
      ],
      "topic": "troubleshooting",
      "filename": "troubleshooting.json"
    },
    {
      "index1": 43,
      "index2": 101,
      "similarity": 0.9940119760479041,
      "same_answers": true,
      "q1_text": "A remote user called the help desk to report a notification indicating there is limited or no connectivity. The user can access local file folders and other local machines but none of the organization's servers or network items. Web pages do not appear to function either. Which of the following is the MOST likely cause of the issue?",
      "q2_text": "A remote user called the help desk to report a notification indicating there is limited or no connectivity. The user can access local file folders and other local\nmachines but none of the organization's servers or network items. Web pages do not appear to function either. Which of the following is the MOST likely cause of\nthe issue?",
      "q1_correct": [
        0
      ],
      "q2_correct": [
        0
      ],
      "topic": "troubleshooting",
      "filename": "troubleshooting.json"
    },
    {
      "index1": 11,
      "index2": 85,
      "similarity": 0.98989898989899,
      "same_answers": true,
      "q1_text": "A user’s desktop computer slows down after a few minutes of use, and the fans alternate between silent and very loud. Which of the following is MOST likely failing, therefore causing these symptoms?",
      "q2_text": "A user's desktop computer slows down after a few minutes of use, and the fans alternate between silent and very loud. Which of the following is MOST likely\nfailing, therefore causing these symptoms?",
      "q1_correct": [
        0
      ],
      "q2_correct": [
        0
      ],
      "topic": "troubleshooting",
      "filename": "troubleshooting.json"
    },
    {
      "index1": 49,
      "index2": 79,
      "similarity": 0.9773462783171522,
      "same_answers": true,
      "q1_text": "A technician receives several error alerts on a server after an unexpected reboot. A message states that one or more disks are in a degraded state. When the\ntechnician advances to the next error message, it indicates the OS is missing. Which of the following are the MOST likely causes of these errors? (Choose two.)",
      "q2_text": "A technician receives several error alerts on a server after an unexpected reboot. A message states that one or more disks are in a degraded state. When the\ntechnician advances to the next error message, it indicates the OS is missing. Which of the following are the MOST likely causes of these errors?",
      "q1_correct": [
        1,
        2
      ],
      "q2_correct": [
        1,
        2
      ],
      "topic": "hardware",
      "filename": "hardware.json"
    },
    {
      "index1": 22,
      "index2": 77,
      "similarity": 0.9702127659574468,
      "same_answers": true,
      "q1_text": "A user requested upgrades to a company-issued laptop to increase its performance while working with a large database stored on drive C. Which of the following\ntasks should a systems administrator complete to BEST meet this goal? (Select TWO).",
      "q2_text": "A user requested upgrades to a company-issued laptop to increase its performance while working with a large database stored on drive C. Which of the following\ntasks should a systems administrator complete to BEST meet this goal?",
      "q1_correct": [
        3,
        4
      ],
      "q2_correct": [
        3,
        4
      ],
      "topic": "hardware",
      "filename": "hardware.json"
    },
    {
      "index1": 2,
      "index2": 6,
      "similarity": 0.9695550351288056,
      "same_answers": true,
      "q1_text": "A technician logs on to a PC and inserts an encrypted USB drive. When opening File Explorer, the technician cannot see the USB drive. Which of the following\ntools should the technician use to see all drives?",
      "q2_text": "Recommend!! \nA technician logs on to a PC and inserts an encrypted USB drive. When opening File Explorer, the technician cannot see the USB drive. Which of the following\ntools should the technician use to see all drives?",
      "q1_correct": [
        1
      ],
      "q2_correct": [
        1
      ],
      "topic": "miscellaneous",
      "filename": "miscellaneous.json"
    },
    {
      "index1": 31,
      "index2": 50,
      "similarity": 0.9656862745098039,
      "same_answers": true,
      "q1_text": "A technician needs to fix a Cat 5 cable issue. The cable, which is connected to a network jack, fails when it is moved around. Which of the following items must the\ntechnician use to fix the issue? (Select TWO).",
      "q2_text": "A technician needs to fix a Cat 5 cable issue. The cable, which is connected to a network jack, fails when it is moved around. Which of the following items must the\ntechnician use to fix the issue?",
      "q1_correct": [
        4,
        5
      ],
      "q2_correct": [
        4,
        5
      ],
      "topic": "networking",
      "filename": "networking.json"
    },
    {
      "index1": 52,
      "index2": 150,
      "similarity": 0.964824120603015,
      "same_answers": true,
      "q1_text": "The owner of a restaurant reports that wireless network connections are lost intermittently throughout the day. Which of the following steps should a technician\ntake to troubleshoot the issue? (Select TWO).",
      "q2_text": "The owner of a restaurant reports that wireless network connections are lost intermittently throughout the day. Which of the following steps should a technician\ntake to troubleshoot the issue?",
      "q1_correct": [
        0,
        3
      ],
      "q2_correct": [
        0,
        3
      ],
      "topic": "troubleshooting",
      "filename": "troubleshooting.json"
    },
    {
      "index1": 21,
      "index2": 89,
      "similarity": 0.96,
      "same_answers": true,
      "q1_text": "A technician made several upgrades to a computer and then determined the power supplied by the PSU is insufficient. Which of the following would MOST likely cause the insufficiency? (Select TWO)",
      "q2_text": "A technician made several upgrades to a computer and then determined the power supplied by the PSU is insufficient. Which of the following would MOST likely\ncause the insufficiency?",
      "q1_correct": [
        3,
        5
      ],
      "q2_correct": [
        3,
        5
      ],
      "topic": "hardware",
      "filename": "hardware.json"
    },
    {
      "index1": 4,
      "index2": 111,
      "similarity": 0.9557522123893806,
      "same_answers": true,
      "q1_text": "A user reboots a machine. On rebooting, the user hears one beep, and then an error message is displayed. Which of the following are MOST likely causing this issue? (Select TWO)",
      "q2_text": "A user reboots a machine. On rebooting, the user hears one beep, and then an error message is displayed. Which of the following are MOST likely causing this\nissue?",
      "q1_correct": [
        0,
        3
      ],
      "q2_correct": [
        0,
        3
      ],
      "topic": "troubleshooting",
      "filename": "troubleshooting.json"
    },
    {
      "index1": 142,
      "index2": 149,
      "similarity": 0.9263157894736842,
      "same_answers": true,
      "q1_text": "Which of the following is a valid IPv4 address?",
      "q2_text": "Which of the following is a public IPv4 address?",
      "q1_correct": [
        2
      ],
      "q2_correct": [
        2
      ],
      "topic": "networking",
      "filename": "networking.json"
    },
    {
      "index1": 12,
      "index2": 29,
      "similarity": 0.9164677804295943,
      "same_answers": true,
      "q1_text": "A technician is troubleshooting connectivity issues and needs to promiscuously route a copy of traffic to a separate machine for analysis. Which of the following physical tools would BEST accomplish this task?",
      "q2_text": "A technician is troubleshooting connectivity issues and needs to promiscuously route a copy of traffic to a separate machine for analysis. Which of the following\nphysical tools v/ould BEST accomplish this task?",
      "q1_correct": [
        2
      ],
      "q2_correct": [
        2
      ],
      "topic": "troubleshooting",
      "filename": "troubleshooting.json"
    }
  ]
}