[
  {
    "ground_truth_id": 1,
    "explanation": "When the battery has come to the end of its life, it will not fully charge nor retain charge for very long. It will also have a tendency to overheat. All other answers are incorrect. The digitizer is the glass on the front of the phone that is used by the touchscreen and would not make the phone hot, even if it were broken. If the cable were faulty, there would be no charge, but the phone would not be hot either. When an iPhone battery is set to low power mode, less power is used and the phone should therefore be cooler."
  },
  {
    "ground_truth_id": 2,
    "explanation": "A DHCP client will only get an Automatic Private IP Address (APIPA) if it cannot obtain an IP address from the DHCP server. This could be because of network issues contacting the DHCP server or because the server has run out of IP addresses. All other answers are incorrect. DNS is used for hostname-to-IP-address name resolution. NETBIOS is a legacy Microsoft name resolution protocol. If they were using a static IP address, then DHCP Enabled would be set to No. 9. All answer choices are correct. The first stage is to make a full backup of the HDD, just in case anything goes wrong. You’ll thereafter remove any redundant data that you are not going to migrate, resize the data partition so it is less than the size of the SSD, clone the old HDD partition, shut down the laptop and remove the old HDD, install and initialize the SSD, and finally, restore the cloned data onto the SSD."
  },
  {
    "ground_truth_id": 3,
    "explanation": "A 13.56-MHz frequency is used by RFID applications. This includes Near-Field Communication (NFC), which is a scanner type used in door access and card payment systems. All other answers are incorrect. Biometrics would not use the phone as an interface. You would simply use your fingerprint or facial recognition to gain access. Certificates are used for encryption and not as an access control. Open Authentication (OAuth) is used for internet-based authentication only."
  },
  {
    "ground_truth_id": 4,
    "explanation": "Most Solid-State Drives (SSDs) come in a 2.5-inch standard form factor. All other answers are incorrect. 3.5 inches is the size of a converter to place an SSD into a computer. 5.25 and 8 inches were the sizes of the first floppy disks."
  },
  {
    "ground_truth_id": 5,
    "explanation": "He should first confirm the power rating of the charger, which is most likely too low to charge the phone and therefore the most probable cause of the issue. All other answers are incorrect. Deleting unwanted apps will reduce resources used by the phone but will not prevent it from charging. Putting the phone back to its factory setting will not fix a power issue. Setting the battery to low power mode will use less battery once the phone has been charged but will do nothing to resolve the current problem. Chapter 1: Mobile Devices 113 13. The correct answers are A and D. The easiest of the available options is a Bluetooth-enabled keyboard to connect to an Android tablet. You can also use a USB-C connector, which you would then connect to either DVI or, preferably, HDMI. All other answers are incorrect. No tablet has an Ethernet connection as these devices are too thin. Lightning cables are used only by Apple phones and tablets."
  },
  {
    "ground_truth_id": 6,
    "explanation": "Near-Field Communication (NFC) is commonly used for card payments. All other answers are incorrect. Tethering is the process of creating a personal hotspot. A digitizer provides touchscreen technology. Dedicated VPN software creates a VPN. 1.2 Compare and contrast the display components of mobile devices"
  },
  {
    "ground_truth_id": 7,
    "explanation": "The digitizer is a piece of glass that enables touchscreen technology. All other answers are incorrect. The inverter converts DC to AC power. Vertical Alignment (VA) supports a contrast ratio of 2000:1. The backlight controls the brightness of an LCD monitor."
  },
  {
    "ground_truth_id": 8,
    "explanation": "The gyroscope is used by the phone to rotate the screen as you twist your phone around. All other answers are incorrect. The bezel is the border between the phone’s frames and the screen. The digitizer is a layer of glass that enables touchscreen functionality. The accelerometer tracks the motion of the phone and adjusts the screen size."
  },
  {
    "ground_truth_id": 9,
    "explanation": "Since the webcam is not showing an image, it is likely to be a setup issue. In this case, reinstalling the webcam is the best solution. All other answers are incorrect. Rebooting the computer will not resolve an image issue. Purchasing a new webcam is unnecessary. Plugging the webcam into another port is unlikely to resolve an image issue."
  },
  {
    "ground_truth_id": 10,
    "explanation": "An inverter converts DC power to AC power. All other answers are incorrect. An inverter does not convert AC to DC power. A digitizer is a piece of glass that provides touchscreen functionality. A backlight increases readability in low-light conditions."
  },
  {
    "ground_truth_id": 11,
    "explanation": "Twisted Nematic (TN) displays use crystals that twist or untwist depending on the voltage level. It supports fast response time in relation to other TFT displays. All other answers are incorrect. Modern IPS displays have similar response times to TN, but the crystals rotate rather than twist. VA panels are prone to blurring and ghosting. A Cathode Ray Tube (CRT) has a display that is prone to screen burn-in and ghosting due to non-uniform use of the screen."
  },
  {
    "ground_truth_id": 12,
    "explanation": "In Windows, if the microphone is not working properly, you should go to Privacy, select Microphone, then ensure the Allow apps to access your microphone feature is turned on. All other answers are incorrect. Rebooting the laptop is unlikely to resolve the issue. Getting an up-to-date driver is unlikely to resolve the issue if you have not enabled access for apps to the microphone. Purchasing additional voice recognition software will not resolve the issue if voice recognition is not enabled in the privacy settings. 114 Solutions"
  },
  {
    "ground_truth_id": 13,
    "explanation": "An LCD monitor gets its brightness from a backlight, so if it fails, the screen may be very dim or even black. All other answers are incorrect. The backlight failing has no relationship to the brightness settings. You can have the brightness set to its highest setting, but if the backlight is malfunctioning, the screen will still be dim. A digitizer is used in touchscreen technology, and a legacy LCD monitor will not be touchscreen. If the VGA cable were broken, the screen would be black."
  },
  {
    "ground_truth_id": 14,
    "explanation": "The digitizer is a thin layer of glass that converts analog touch into digital signals, and in this scenario, the most likely reason for the black areas is that the digitizer is broken. All other answers are incorrect. The Liquid Contact Indicators (LCIs) on an iPhone are normally white or silver, and if the phone has suffered water damage, these will be red. Look at the side of the phone with a lighted magnifying glass to view this. Inverters are used by older laptops to convert DC power from the motherboard to AC power. If the brightness of the phone were too low, it would be uniform across the entire screen and would not appear as dark patches."
  },
  {
    "ground_truth_id": 15,
    "explanation": "In-Plane Switching (IPS) uses crystals that rotate rather than twist. This means that it produces better color definition with a wider range of viewing angles, making it suitable for both gaming and graphic design. All other answers are incorrect. LEDs can be used for low-budget gaming but not for graphic design. LCDs deliver less color accuracy than LED displays, which makes them a poor choice. CRTs are a legacy display technology and are not suitable for either gaming or graphic design."
  },
  {
    "ground_truth_id": 16,
    "explanation": "Vertical Alignment (VA) uses crystals that tilt rather than twist or rotate and supports a wider color gamut and a contrast ratio of 2000:1 or 3000:1. However, the viewing angles are not as good as In-Plane Switching (IPS), making it more prone to blurring and ghosting. All other answers are incorrect. OLED could be described as having an infinite contrast ratio and can support 1,000,000:1. IPS can only support a contrast ratio of up to 1200:1. VGA has an aspect ratio of 4:3."
  },
  {
    "ground_truth_id": 17,
    "explanation": "In an Organic Light-Emitting Diode (OLED) display, each pixel is produced by a separate LED. This screen therefore does not require a separate backlight. OLEDs are used in modern TVs, smartphones, monitors, and tablets. All other answers are incorrect. A Cathode Ray Tube (CRT) is a legacy display and uses a backlight. Liquid Crystal Displays (LCDs) use a fluorescent backlight. Light-Emitting Diode (LED) displays also use various backlight configurations."
  },
  {
    "ground_truth_id": 18,
    "explanation": "When users have connected dual monitors and there is no image, they will need to adjust the display settings by going to Settings, Home, Display, Multiple Displays, and then selecting Extend these displays. This will enable dual monitors. All other answers are incorrect. If they choose the Duplicate these displays option, the image will be the same on both screens. They cannot create a dual-monitor setup using the Projecting to this PC option. 13. The correct answers are A and D. The iPhone must be within 10 meters of the speaker, and Bluetooth must be enabled in user Settings. All other answers are incorrect. There is no Bluetooth option under General settings, and 20 meters is out of the range of Bluetooth devices. Chapter 1: Mobile Devices 115"
  },
  {
    "ground_truth_id": 19,
    "explanation": "The wireless antenna is normally located on the bezel on the top of the laptop. All other answers are incorrect. There are no interface cards on the front or the rear of a laptop; they are normally on the sides. If the wireless antenna were on the base, there would be no signal."
  },
  {
    "ground_truth_id": 20,
    "explanation": "The digitizer is a piece of glass that sits over the phone screen and enables touchscreen functionality. When you can see the icons perfectly but cannot open them, this most likely means that the digitizer is broken and will need to be replaced. All other answers are incorrect. If there was no power, the screen would be black. A broken CPU would mean that each app would respond but would be much slower than normal. “All of the above” is not the correct solution as some answers are incompatible. 16. The correct answers are B and C. The touchpad (sometimes known as the trackpad) can be used instead of a mouse. If it is unresponsive, the first step is to remove an external mouse. If that does not work, then you need a driver update. All other answers are incorrect. Rebooting the laptop will not resolve this issue. A gyroscope is used by phones and tablets to rotate their screens when you change the orientation of the device. 1.3 Given a scenario, set up and configure accessories and ports of mobile devices"
  },
  {
    "ground_truth_id": 21,
    "explanation": "The charger for iPhone 10 uses a Lightning cable. All other answers are incorrect. USB-A is used by computers, TVs, and gaming consoles. USB-B is used by printers, and USB-C is used by Android phones and most other new devices, such as game controllers and earbud cases. 2. The correct answers are A and C. A legacy laptop will not have a USB 3.0 port. It could also be that the USB slot is the wrong form factor. All other answers are incorrect. It is very unlikely that the USB drive being upside down is the source of the problem, as any user would try it both ways around, thereby easily resolving the issue. It is unlikely that damage has been caused to the end of a USB drive as it is very robust. It would be more likely to be the case that is damaged."
  },
  {
    "ground_truth_id": 22,
    "explanation": "The Samsung Galaxy uses a USB-C connector. All other answers are incorrect. No phones use a normal USB connector. Micro USBs are used for small devices such as power banks, headphones, and gaming controllers. Mini USB ports were used to transfer data from early smartphones and PDAs."
  },
  {
    "ground_truth_id": 23,
    "explanation": "When a cable cannot be fully inserted into a charging port, the most likely reason is a build-up of lint or another foreign object that is lodged in the port. The best way to remove the lint is to give it a good blast of compressed air. All other answers are incorrect. You should not blow into the port as your breath contains moisture that could damage the electrical components. You should never use WD-40 as it is a liquid and spraying electrical components is an electrical hazard. When it dries it leaves an oily residue. You could also use a toothpick for this job, but using a metal object such as a pin or needle risks causing an electrical short circuit that could damage the phone. 116 Solutions 5. The correct answers are B and C. Before using any Bluetooth product, you must first enable Bluetooth on the phone, then pair both devices. All other answers are incorrect. There is no need to install drivers on a smartphone that has built-in Bluetooth capability. Until the devices are paired, any music you play will come through the phone speakers and not the earbuds. 6. The correct answers are A, D, and E. A docking station is a sophisticated port replicator and, when combined with DisplayPort, can provide keyboard and mouse, speaker, and dual-monitor functionality. All other answers are incorrect. Wi-Fi normally comes built in, but if the laptop is older, you may need to purchase a Wi-Fi card. Laptops usually come with Ethernet ports, but for older models, you will need to purchase a network card."
  },
  {
    "ground_truth_id": 24,
    "explanation": "Using a smartphone to create a personal hotspot is the fastest way to get internet access on their laptop. All other answers are incorrect. Traveling 10 miles might mean missing the conference call due to traffic and the user would be overheard by other Starbucks customers even if they did make it in time. Connecting an Ethernet cable directly to a wireless router that has no connectivity is not a solution. Rebooting the wireless router is not going to obtain an internet connection."
  },
  {
    "ground_truth_id": 25,
    "explanation": "Port replicators can be plugged into the back of a laptop to give the user a variety of additional ports. All other answers are incorrect. A KVM switch is used for the keyboard, mouse, and monitor when there are multiple monitors or computers attached. A dual monitor will only give you a second monitor; it will not fulfill the other requirements. A hub is an internal device that is used to connect multiple computers. 9. The correct answers are A, C, and D. When you are having problems with the touchscreen, and it shows any erratic behavior, the first thing you should do is check that the screen is not damaged. Then, check that it is clean. After that, you should recalibrate the screen. The remaining answer is incorrect. The touch pen battery life has nothing to do with erratic cursor behavior. If the battery were running low, the touch pen would simply become unresponsive."
  },
  {
    "ground_truth_id": 26,
    "explanation": "The micro USB connection was replaced by the USB-C cable. All other answers are incorrect. Serial cables are legacy cables that used an RS232 port. Lightning cables are used by Apple devices only. Parallel cables are old cables used by printers and have since been replaced by USB."
  },
  {
    "ground_truth_id": 27,
    "explanation": "The iPhone 14 uses a USB-C charger. All other answers are incorrect. The charger for iPhone 11 uses a Lightning cable, while iPhone 12 and 13 models come with a Lightning-to-USB-C connector. USB-A is used by computers, TV, and gaming consoles. USB-B is used by printers, and USB-C is used by Android phones and most new devices, such as game controllers and earbud cases."
  },
  {
    "ground_truth_id": 28,
    "explanation": "Serial devices that use the nine-pin RS-232 hardware port include legacy mice, printers, and modems. All other answers are incorrect. RJ45 is used by Ethernet cables. RJ11 was used to connect a modem to a telephone line. Parallel connections are used by legacy printers. Chapter 1: Mobile Devices 117 13. The correct answers are A and C. Web cameras can only provide input to one type of software at a time. If the webcam privacy setting is not set to Allow apps to access this camera, then the webcam will not work. All other answers are incorrect. It is unlikely that plugging the webcam into another port will resolve the issue as it worked yesterday. Purchasing another webcam will not resolve the issue of software clashes or enable the camera setting to allow apps to use the camera."
  },
  {
    "ground_truth_id": 29,
    "explanation": "Windows devices have features such as sensitivity and touch mode for touchscreens. You can adjust the touchscreen settings and calibrate the screen under the computer settings. All other answers are incorrect. When setting up the touchscreen, a digitizer is installed. At the time of this installation, the technician must ensure that there are no air bubbles. However, as the screen was working previously (i.e., after its initial installation), air bubbles beneath the glass are not likely to be the current problem. The display settings affect the screen, not the touchscreen itself. A touchscreen only needs between 0.1 and 2 watts; it is a very low-power aspect of the device."
  },
  {
    "ground_truth_id": 30,
    "explanation": "When a webcam stops functioning, the first thing to try is to unplug it and then plug it back in. If that fails to work, then you should uninstall it completely and reinstall the webcam software and any latest updates from the manufacturer’s website. All other answers are incorrect. When an update is applied to an operating system, it is likely that the computer has already been rebooted as part of the update, so doing so again is unlikely to help. It is most likely that there is nothing wrong with the webcam, and the user may not have enough time to go to the shops, make a purchase, and set it up before the Zoom conference commences. There is no need to update the operating system as this has already been done and is the root cause of this issue."
  },
  {
    "ground_truth_id": 31,
    "explanation": "NFC is used for card payment types where the card must be within four inches of the reader and so would be the source of the problem described. All other answers are incorrect. Bluetooth is too insecure for financial transactions. Wireless is not used by contactless cards. Infrared requires a line of sight between two devices and has no security; therefore, it is not used for financial transactions. 17. The correct answers are B, C, and E. When a cell phone gets hot, it may be due to excessive use, such as being used as a Wi-Fi hotspot for a long time. Phones also overheat when the battery is nearing the end of its lifespan, at which point it also fails to charge fully and can lose charge very quickly. Having too many applications open at the same time forces the CPU to work harder than normal and, especially in the case of outdated applications, can also increase the phone’s temperature. All other answers are incorrect. A cracked screen does not make the phone hot but may prevent the screen from responding. A cheap charging cable will prevent the phone’s battery from being charged."
  },
  {
    "ground_truth_id": 32,
    "explanation": "Apple introduced the reversible Lightning cable in 2012 to replace the Apple 30-pin connector. All other answers are incorrect. 20-pin and 25-pin connectors do not exist. Most of Android phones use the USB-C connector. 118 Solutions 1.4 Given a scenario, configure basic mobile-device network connectivity and application support"
  },
  {
    "ground_truth_id": 33,
    "explanation": "Most companies have a data cap on their mobile devices and wireless routers that need to be topped up once the limit has been reached. All other answers are incorrect. Network coverage must be available in the area as the salesperson was able to watch a movie online the previous evening. MDM solutions test updates prior to releasing them. Companies are highly unlikely to miss mobile phone payments as they are critical to business operations."
  },
  {
    "ground_truth_id": 34,
    "explanation": "A password is “something you know” and a fingerprint is “something you are”. This is an example of two-factor authentication. All other answers are incorrect. A retina and fingerprint are both “something you are”, a password and PIN are both “something you know”, and gait and swiping a card are both “something you do”."
  },
  {
    "ground_truth_id": 35,
    "explanation": "If a SIM card is not installed in a new smartphone, the user will not be able to make any calls or get access to mobile data. All other answers are incorrect. You cannot turn on mobile data without a SIM card. The film protecting the screen does not affect call functionality or mobile data. Activating Bluetooth does not affect calls or mobile data."
  },
  {
    "ground_truth_id": 36,
    "explanation": "The easiest way to pair an Apple Watch with an iPhone is to use the Apple Watch app. This is done by aligning the watch face with your phone camera, just as you would scan a QR code. All other answers are incorrect. Although you can manually set up pairing by entering a six-digit passcode, it is not the easiest method. You cannot pair devices manually using a four-digit passcode; it needs to be six digits. The four-digit code is only used to access the Apple Watch itself."
  },
  {
    "ground_truth_id": 37,
    "explanation": "When a calendar application is not updating, it is normally down to the password not being updated. Updating the corporate password should resolve the issue. All other answers are incorrect. The remaining battery has no impact on the calendar application. Rebooting the phone will not have any impact on the phone app. Remotely wiping the phone will not help in this scenario as doing so will revert the device to its factory settings."
  },
  {
    "ground_truth_id": 38,
    "explanation": "A Global System for Mobile Communication-based phone has a removable SIM that can be inserted into another handset with the same network provider. All other answers are incorrect. Global System for Mobile Communication can work with cellular, wireless, and satellite communications, so all other answers that use the word “only” are false."
  },
  {
    "ground_truth_id": 39,
    "explanation": "MDM solutions allow you to enforce policies and send updates to smartphones. Remotely wiping devices will revert them to factory settings. All other answers are incorrect. WPA2 PSK means connecting to a wireless network using a password. Disabling Bluetooth will only prevent Bluetooth devices from being used. Using a VPN on company phones only secures a remote session from the phone. It does not prevent access to the local data on the phone. Chapter 1: Mobile Devices 119 8. The correct answers are B and C. MAM solutions are used to set policies for apps that can process corporate data and prevent the transfer of corporate data to personal devices. All other answers are incorrect. Mobile Device Management (MDM) is responsible for patching mobile devices and remotely wiping them when they are lost or stolen to prevent data compromise."
  },
  {
    "ground_truth_id": 40,
    "explanation": "Samsung Galaxy users use Google Drive as their backup location. All other answers are incorrect. Gmail is the Google email application. Knox containers are used by Samsung to separate personal and business data on their phones. Office 365 is a Microsoft product."
  },
  {
    "ground_truth_id": 41,
    "explanation": "When a user downloads and installs an app from the Apple App Store, they need their Apple ID and password. If the installation fails, they will need to reset the password. All other answers are incorrect. A Hotmail account is used to access Microsoft products. A Gmail account is used to access Google products. The iPhone passcode is used to access the iPhone itself."
  },
  {
    "ground_truth_id": 42,
    "explanation": "Satellite communication devices connect to satellites above the earth and can communicate in areas where no cell phone masts exist. All other answers are incorrect. Digital Subscriber Line (DSL) requires the use of a splitter to enable phone and internet to be used at the same time. A hotspot connects to a wireless or cellular provider and cannot be used in this case."
  },
  {
    "ground_truth_id": 43,
    "explanation": "If the weather app is left running constantly, it will drain the iPhone battery. They need to both turn off severe weather notifications and modify the location permissions so that they can manually enter the location for which they want to get results. All other answers are incorrect. The location services While Using Your App will still drain the battery. Turning off location services does not affect the weather app. It merely prevents the user from getting notifications when they enter a different country. A local wireless network connection merely provides internet and would not drain the battery. Purchasing a new battery will not resolve this issue."
  },
  {
    "ground_truth_id": 44,
    "explanation": "When the phone is set to power conservation mode, the battery will only charge 50-60%. Smartphones may enter low power mode if the battery is being drained too quickly, and GPS will not work when the phone is in low power mode. Switching this off would correct the issue. All other answers are incorrect. Enabling Bluetooth only allows Bluetooth devices to connect to the phone. Cleaning the touchscreen does not affect GPS. GPS does not use Wi-Fi settings."
  },
  {
    "ground_truth_id": 45,
    "explanation": "If the agent turns off location services, they will prevent the phone’s GPS location from being advertised. All other answers are incorrect. You cannot set location services to pause, nor can you delete them."
  },
  {
    "ground_truth_id": 46,
    "explanation": "Your iPhone is backed up to iCloud. All other answers are incorrect. Microsoft uses Office 365, and Google uses Google Drive. Apple uses neither. Boot Camp is an Apple product, but its purpose is to host third-party operating systems. 120 Solutions"
  },
  {
    "ground_truth_id": 47,
    "explanation": "In Windows 10, the tile turns blue when Bluetooth is switched on. All other answers are incorrect. The tile is gray when it is switched off. The Bluetooth tile will never appear white or green in Windows 10."
  },
  {
    "ground_truth_id": 48,
    "explanation": "Data Loss Prevention (DLP) prevents someone from sending an email containing PII and sensitive information. It blocks data if it finds a pattern match. All other answers are incorrect. A legal hold prevents users from deleting emails from a mailbox. MailTips warn you of events such as a large distribution group being chosen prior to dispatching an email. A firewall is used to block traffic coming into or going out of your company’s networks."
  },
  {
    "ground_truth_id": 49,
    "explanation": "GSM phones have removable SIM cards that can be used in another handset from the same provider, whereas CDMA phones have no SIM cards as the provider has a built-in handset. All other options are incorrect."
  },
  {
    "ground_truth_id": 50,
    "explanation": "The Preferred Roaming List (PRL) is a database held on your mobile telephone. This is used when your phone connects to the tower. The salesperson will need to install a PRL update to enable roaming data on their smartphone. All other answers are incorrect. A firmware update will not update the PRL database on your phone. Turning on location services just advertises the location of your phone. Restarting the smartphone will not work in this situation."
  },
  {
    "ground_truth_id": 51,
    "explanation": "The user will need to go to Settings, then Mobile Data, to enable a 4G data connection. All other answers are incorrect. Wi-Fi calling only allows you to communicate from remote locations as long are there is an internet connection over Wi-Fi. 21. The correct answers are A, C, D, and E. Following a 14-day free trial, a Google Workspace subscription starts at $5.75 per user and allows access to many applications, at least 30 GB of storage, and video meetings with up to 100 users. All other answers are incorrect. You cannot create virtual machines, and a live.com email address is for Microsoft products."
  },
  {
    "ground_truth_id": 52,
    "explanation": "A legal hold means that a mailbox has no mailbox limit, and any deleted emails are retained in a purges folder. This prevents a user under investigation from deleting emails. All other answers are incorrect. If they set a backup at a certain time each day, they will not capture any emails that have been removed from the deleted items folder. A forensic toolkit is used to extract data from a computer and will not be able to extract emails that have been deleted from the deleted items container. Chain of custody refers to the bagging, tagging, and signing over of evidence to anyone handling the data to prove to the judge that it is the original evidence. 23. The correct answers are B, C, and D. If you are wearing a headset, go into Zoom, then Audio Settings | Microphone | Test mic. When testing a Bluetooth connection, if you are wearing earbuds, then go to your phone and play some music. If you hear music, then you are connected. If you are wearing a headset, you can go into Zoom, and under Audio Settings, you can go to Speaker | Test speaker. All other answers are incorrect. There are no options under Video Settings to test speakers or microphones as it deals only with the camera and video. A Bluetooth connection is only shown in blue when you are using a Windows 10 laptop and not earbuds. Chapter 2: Networking 121 Chapter 2: Networking 2.1 Compare and contrast TCP and UDP ports, protocols, and their purposes"
  },
  {
    "ground_truth_id": 53,
    "explanation": "Secure Shell (SSH) is used for secure remote access. All other answers are incorrect. Telnet provides unsecure remote access, RDP uses port 3389 and is a secure remote access protocol that can only be used to connect to Microsoft desktops/servers, and SNMP 161 is unsecure and provides status and reports on network devices."
  },
  {
    "ground_truth_id": 54,
    "explanation": "Hypertext Protocol Secure (HTTPS) is used when establishing a secure session on a web server. All other answers are incorrect. TFTP is unsecure and is used to transfer configuration files. HTTP is used to make an unsecure session on a web server. SSH is used for secure remote access."
  },
  {
    "ground_truth_id": 55,
    "explanation": "Post Office Protocol (POP) is a legacy mail client that stores emails locally and uses port 110. All other answers are incorrect. IMAP is a mail client that provides diaries and calendars, allows you to create multiple folders, has a permanent connection to the mail server, and uses TCP port 143; SMTP is used to transfer email between mail servers and uses TCP port 25."
  },
  {
    "ground_truth_id": 56,
    "explanation": "Server Message Block (SMB) uses port 445 for file and print sharing in a Windows environment. However, it is internal only and cannot be used on the internet. All other answers are incorrect. NETBIOS (ports 137-139) is used for legacy name registration and resolution by Microsoft. 67/68 are used by DHCP to automatically assign IP addresses. 389 is used by LDAP that is used to manage directory services by querying and updating X500 directory objects."
  },
  {
    "ground_truth_id": 57,
    "explanation": "Port 995 is the standard port used by Secure Post Office Protocol (SPOP). All other answers are incorrect. Unsecure POP uses 110. Secure IMAP uses 993. Unsecure IMAP uses 143."
  },
  {
    "ground_truth_id": 58,
    "explanation": "User Datagram Protocol (UDP) is connectionless and can be used to stream video and audio. All other answers are incorrect. TCP is connection-orientated and far too slow for audio or streaming video. RDP is used for secure remote access to Windows servers/desktops. TFTP is a connectionless fast transfer of data. Normally, it is used by network devices to obtain configuration files."
  },
  {
    "ground_truth_id": 59,
    "explanation": "Simple Network Management Protocol (SNMP) v3 is secure and uses UDP port 162. All other answers are incorrect. SNMP uses UDP port 161 but is insecure. Port 389 is used by LDAP to create, manage, and search directory services. POP (the unsecure mail client) uses TCP port 110. 122 Solutions"
  },
  {
    "ground_truth_id": 60,
    "explanation": "File Transfer Protocol (FTP) port 21 is unsecure and transfers data in clear text. All other answers are incorrect. TFTP is a UDP version of FTP. SSH is a secure method of remote administration. FTPS is a secure version of FTP. 9. The correct answers are B and D. Hypertext Transfer Protocol (HTTP) uses port 80 and Hypertext Transfer Protocol Secure (HTTPS) uses port 443. All other answers are incorrect. Port 23 is used by Telnet. Port 110 is used by POP. Port 445 is used by SMB."
  },
  {
    "ground_truth_id": 61,
    "explanation": "The correct sequence for the Transmission Control Protocol (TCP) three-way handshake is SYN, then SYN-ACK, and, finally, ACK. The sequences in all the other answers are incorrect."
  },
  {
    "ground_truth_id": 62,
    "explanation": "Simple Mail Transfer Protocol (SMTP) uses port 25. All other answers are incorrect. FTP uses port 21. SFTP, SSH, and SCP all use port 22. Telnet uses port 23."
  },
  {
    "ground_truth_id": 63,
    "explanation": "Port 993 is the standard port used by secure Internet Mail Access Protocol (IMAP). All other answers are incorrect. Unsecure POP uses 110. Secure POP uses 995. Unsecure IMAP uses 143."
  },
  {
    "ground_truth_id": 64,
    "explanation": "Telnet is an insecure remote access protocol. All other answers are incorrect. SSL is an encryption-based protocol designed for securing connections between web clients and servers. SSH is a secure remote access protocol than can replace Telnet. RDP is a secure access protocol for Windows operating systems. 2.2 Compare and contrast common networking hardware 1. The correct answers are B and C. The back of the patch panel is where wires are terminated at the IDC using a punch-down tool, and the front has prewired RJ45 ports. All other answers are false."
  },
  {
    "ground_truth_id": 65,
    "explanation": "An SDN allows the rapid provisioning and deprovisioning of networks in a virtual environment. All other answers are incorrect. A WAN is a network over a large geographical area. A LAN is a network that is secure and doesn’t extend beyond close proximity, for example, a building or even just a single floor of the building. A SAN comprises fast redundant disks."
  },
  {
    "ground_truth_id": 66,
    "explanation": "A UTM solution can perform multiple security functions. All other answers are incorrect. A stateless firewall can only perform basic packet filtering. A host-based firewall can only protect a desktop or laptop, blocking and allowing certain types of traffic. A stateful firewall can provide deep inspection of traffic to assess the verbs in use. For example, in HTTP traffic, the GET verb can be allowed while the PUT or POST verbs can be blocked."
  },
  {
    "ground_truth_id": 67,
    "explanation": "The ONT converts optical signals to electrical signals. All other answers are incorrect. FTTC is where a telecom provider runs fiber cables to multiple customers. ONT does not convert electrical signals to optical signals. The reverse is true. An optical line terminal (OLT) is located in a street cabinet, and the ONT is on the customer’s premises. Chapter 2: Networking 123"
  },
  {
    "ground_truth_id": 68,
    "explanation": "Power over Ethernet (POE) allows a device to pull its power from the switch. All other answers are incorrect. Thunderbolt can be used as a display interface, similar to HDMI or a display port. A managed switch is an enterprise switch that has 28 or 48 ports and can be configured by a web or command-line interface. A shielded twisted pair cable has the wires wrapped in foil for more protection and to limit EMI."
  },
  {
    "ground_truth_id": 69,
    "explanation": "A broadcast domain refers to the number of people that you can broadcast to. If you create a Virtual Local Area Network (VLAN) on a managed switch, you can reduce its size. All other answers are incorrect. A load balancer sends an incoming client request to the least utilized of a number of web servers performing the same function. A router joins multiple networks together. A hub is a slow device that connects multiple hosts together."
  },
  {
    "ground_truth_id": 70,
    "explanation": "A Storage Area Network (SAN) is a set of fast redundant disks used by virtual servers for storage to host the server’s virtual machines. All other answers are incorrect. A PAN is a personal area network normally used by Bluetooth devices and smartphones. A cluster uses a quorum disk that is shared by two servers, one of which is active and the other passive and waiting for the active server to fail. RAID 0 is a setup involving an array of disks as a stripe set for faster reads. However, if one disk fails, then it takes down the whole RAID 0 configuration. It does not provide fault tolerance or redundancy."
  },
  {
    "ground_truth_id": 71,
    "explanation": "Installing power injectors allows you to connect your POE device to a non-POE switch. All other answers are incorrect. A UPS is used to allow a server to shut down gracefully following a complete loss of power. A generator is an alternative power source following a complete loss of power. The purchase of two POE-capable switches is not cost effective."
  },
  {
    "ground_truth_id": 72,
    "explanation": "An unmanaged switch is taken out of the box and plugged in. All other answers are incorrect. A managed switch is an enterprise switch that has 28 or 48 ports and can be configured by a web or command-line interface. An aggregate switch is used to aggregate data from multiple switches and forward it to a core switch. A power diode switch is used for lights."
  },
  {
    "ground_truth_id": 73,
    "explanation": "A hub is an internal legacy device that was implemented to connect hosts using 10BASE-T Ethernet cabling. All other answers are incorrect. A load balancer receives client requests and sends them to the least utilized host. These servers all perform the same job function. A switch is a more modern device that connects hosts but, unlike the hub, can send the traffic to one particular host and is therefore a faster replacement for the hub. A router is a device that connects networks together."
  },
  {
    "ground_truth_id": 74,
    "explanation": "A firewall and router control access by an access control rule (ACL). When installed, only one rule is set up: the last rule, deny. When traffic arrives at the firewall and there is no allow rule, the last rule of deny will be applied. This is known as implicit deny. All other answers are incorrect. No allow rule means the document will be blocked. The document will be blocked at the network level and therefore will never get as far as the host. Explicit deny occurs when a deny rule has been set up on the firewall. 12. All statements are true. 124 Solutions 13. The correct answers are A, C, and D. The application layer applies business logic to prioritize traffic. The control layer contains routing information and is inserted between the application and infrastructure layer and uses a virtual device known as the SDN controller. The infrastructure layer handles the routing and switching of traffic. All other answers are incorrect. The transport layer uses TCP or UDP for the delivery of packets. The data link layer provides error control and framing, moving from the physical layer to the network layer. The physical layer defines the connection and transmission types, such as Ethernet, wireless, or token ring."
  },
  {
    "ground_truth_id": 75,
    "explanation": "Cat 5 cable is a type of Ethernet cable that uses an RJ45 connector. All other answers are incorrect. A BNC connector uses a coax cable. An RJ11 connector is used to connect a modem to a telephone line. A Cat 3 cable runs at 10Mbps while Cat 5 runs at 100Mbps."
  },
  {
    "ground_truth_id": 76,
    "explanation": "802.3at (POE+) allows powered devices to draw up to about 25W. All other answers are incorrect. 802.11 is a wireless standard. 802.3af allows powered devices to draw up to about 13W. 802.3bt (POE++ or 4PPOE) allows powered devices to draw up to 51W (type 3) or 71W (type 4). 16. The correct answers are B and D. Asymmetrical Digital Subscriber Line (ADSL) has a faster download than upload speed, and symmetric DSL has the same upload and download speed. All other answers are false. 2.3 Compare and contrast protocols for wireless networking 1. The correct answers are A, C, D, and E. Only Wi-Fi 5 is incorrect. Wi-Fi 6 (802.11ax), 802.11 b and g, and Wi-Fi 4 (802.11n) all operate on 2.4GHz. Wi-Fi 5 (802.11ac) operates at 5GHz."
  },
  {
    "ground_truth_id": 77,
    "explanation": "Wi-Fi 6 (802.11ax) operates in both the 2.4GHz and 5GHz ranges, thus creating more available channels. Wi-Fi 6 chipsets support a total of 12 channels, eight in the 5GHz and four in the 2.4GHz range. All other answers are incorrect. 802.11b supports 2.4GHz. 802.11g supports 2.4GHz, and 802.11a supports 5GHz."
  },
  {
    "ground_truth_id": 78,
    "explanation": "The user should go to Settings on the smartphone, enable Bluetooth, then pair the device. All other answers are incorrect."
  },
  {
    "ground_truth_id": 79,
    "explanation": "Long-range fixed wireless can be used as a bridge to connect two wireless networks and can be either licensed or unlicensed. All other answers are incorrect. GPS is used to determine your latitude and longitude using orbital satellites. Unlicensed wireless networks use a public frequency and interference is a risk. Licensed wireless networks are those for which exclusive rights are purchased to a given frequency band within a given geographical area from the relevant regulator."
  },
  {
    "ground_truth_id": 80,
    "explanation": "Near-Field Communication (NFC) is used for short-range contactless payments. All other answers are incorrect. Bluetooth is used to connect devices wirelessly and share data. RFID is used to tag high-value items to prevent them from being stolen. Tethering is the protocol whereby your phone is used to create an internet connection for a laptop or desktop using a data cable. Chapter 2: Networking 125"
  },
  {
    "ground_truth_id": 81,
    "explanation": "802.11a is 5GHz only. All other answers are incorrect. 802.11b and 802.11g are 2.4GHz only. 802.11n uses both 2.4 and 5GHz, known as Multiple Input Multiple Output (MIMO). It can multiplex signal streams from 2-3 separate antennas. 7. The correct answers are A and C. 2.4GHz is both slower and covers a greater distance than 5GHz. All other answers are incorrect."
  },
  {
    "ground_truth_id": 82,
    "explanation": "802.11ax goes up to 3.5GBps. All other answers are incorrect. 802.11c goes up to 866 Mbps. 802.11a runs at 54 Mbps. 802.11b runs at 11Mbps."
  },
  {
    "ground_truth_id": 83,
    "explanation": "Both 802.11b and 802.11g work on a frequency of 2.4GHz. All other answers are more modern than 802.11g and are therefore not backward compatible. 10. The correct answers are B and C. 5GHz is less effective at propagating through solid surfaces, supports more individual channels, and suffers less congestion than 2.4GHz. All other answers are incorrect. 2.4GHz can penetrate solid surfaces much better than 5GHz but supports fewer channels and therefore suffers more congestion."
  },
  {
    "ground_truth_id": 84,
    "explanation": "802.11n uses both 2.4 and 5GHz, which is known as Multiple Input Multiple Output (MIMO). It can multiplex signal streams from 2-3 separate antennas. All other answers are incorrect. 802.11a is 5GHz only. 802.11b and 802.11g are 2.4GHz only. 2.4 Summarize services provided by networked hosts"
  },
  {
    "ground_truth_id": 85,
    "explanation": "The Dynamic Host Configuration Protocol (DHCP) server allocates an IP address to each host, and this should be checked first. All other answers are incorrect. A domain controller authenticates hosts. A DNS server provides name resolution and would be an issue if you could not access websites. A mail server provides users with access to email."
  },
  {
    "ground_truth_id": 86,
    "explanation": "When you have network connectivity but cannot access any websites, it means that you cannot access a DNS server. All other answers are incorrect. If you have an internet connection, then your log-on has been successful. If you have an internet connection, then your IP address is valid. There is no need to check the web server location as it will not change."
  },
  {
    "ground_truth_id": 87,
    "explanation": "A proxy server can do webpage caching. All other answers are incorrect. File servers store documents. UTM firewalls can provide content filtering, URL filtering, and malware inspection. Web servers host websites but cannot cache the pages."
  },
  {
    "ground_truth_id": 88,
    "explanation": "A SCADA network is an industrial control system that can be used in the production of oil or gas. All other answers are incorrect. There is no such network as a production network. A local area network is not used in the production of oil or gas but rather hosts many users and devices. A Metropolitan Area Network (MAN) is a network within a city used by either the police, ambulance, or fire services. 126 Solutions 5. The correct answers are A and C. IoT devices need access to the internet and often fall into the category of home automation. Alexa is used by many households to find out facts or play music. A smart meter can tell you the amount of energy that you use and at the same time update your energy supplier. All other answers are incorrect. Neither alarm clocks nor headsets require internet access. 6. The correct answers are A, C, and D. A spam gateway prevents spam from entering your network using SPF, DKIM, and DMARC. It also uses DLP to prevent PII and other sensitive information from leaving your network and filters incoming messages to users’ mailboxes. However, an organization will never send out spam through a spam gateway."
  },
  {
    "ground_truth_id": 89,
    "explanation": "A load balancer can deal with a high volume of web traffic and route it to the least-utilized host. Installing one ensures that all web servers are utilized efficiently. All other answers are incorrect. A cluster is two servers sharing a quorum disk to provide high availability. A proxy server filters outgoing traffic and caches webpages. A DNS server provides hostname-to-IP-address name resolution."
  },
  {
    "ground_truth_id": 90,
    "explanation": "A mail server uses Simple Mail Transfer Protocol (SMTP) to transfer email using port 25. All other answers are incorrect. DNS servers use port 53. DHCP servers use ports 67/68. Proxy servers use port 8080."
  },
  {
    "ground_truth_id": 91,
    "explanation": "A web server hosts websites, each of which has a home page through which customers can access applications and information about a product or service. All other answers are incorrect. A file server is an internal service that hosts data. A mail server contains mailboxes. A RADIUS server, also known as an AAA server, provides authentication from supplicants."
  },
  {
    "ground_truth_id": 92,
    "explanation": "\\\\server1\\data is a UNC path used to connect either to a file or print service. Since the name of the share is data, it will be a file share. All other answers are incorrect. A print server allows someone to send documents to a printer. A syslog server centralized log files from multiple servers. A proxy server caches website pages and controls outbound traffic via URL and content filters."
  },
  {
    "ground_truth_id": 93,
    "explanation": "A RADIUS server is an AAA server that provides authentication, authorization, and accounting without needing to hold a copy of the directory services. Supplicant is another name for devices such as VPN servers, switches, and access points. All other answers are incorrect. A syslog server centralizes log files from multiple sources. A DNS server provides hostname-to-IP-address resolution. A proxy server caches webpages and handles URL and content filtering."
  },
  {
    "ground_truth_id": 94,
    "explanation": "It is likely that the driver for the operating system is not on the installation media. Therefore, we need to download the up-to-date driver from the manufacturer’s website. All other answers are incorrect. Chapter 2: Networking 127"
  },
  {
    "ground_truth_id": 95,
    "explanation": "A syslog server is also known as a log collector and centralizes log files from multiple servers. All other answers are incorrect. A file server hosts documents that are to be accessed by members of the domain. A domain controller authenticates users within a domain."
  },
  {
    "ground_truth_id": 96,
    "explanation": "IoT devices have default passwords that can be found on search engines. Because the device is connected to the internet, a hacker could use these publicly available passwords and gain access to your home network. Therefore, the first thing the user should do is reset the default password to something more secure. All other answers are incorrect. Some IoT devices have no means of updating and this is not the main priority. If you disconnect an IoT device from the internet, it will not function as it is an internet-connected device. Reading the user manual is important but not as important as your home security. 2.5 Given a scenario, install and configure basic wired/wireless small office/home office (SOHO) networks"
  },
  {
    "ground_truth_id": 97,
    "explanation": "A static address is set up manually, and a server or printer IP address should never change. All other answers are incorrect. Dynamic addresses are allocated by DHCP. These addresses could continually change, and users will have difficulty connecting to it. APIPA cannot be set up as they are allocated when a fault has been detected. Servers can be allocated either a public or private IP address, but static is more relevant."
  },
  {
    "ground_truth_id": 98,
    "explanation": "Private IP addresses can only be used in an internal network. All other answers are incorrect. Private IP addresses can be used in networks with up to 16,777,214 hosts. Every IPv4 address has a network ID and a host ID."
  },
  {
    "ground_truth_id": 99,
    "explanation": "131.107.1.1 is a Class B public IP address. All other answers are incorrect. 192.168.1.1 is a private IP address. 169.254.1.223 is an APIPA that is allocated. You cannot get an IP address from DHCP. 172.16.5.14 and 10.10.15.6 are private IP addresses. IP addresses starting 10.172 and 192 are private IP addresses and can only be used internally. 169.254.x.x is an APIPA and cannot be used externally. Any other IP address ranges than these are public and can be used on the internet."
  },
  {
    "ground_truth_id": 100,
    "explanation": "Class B addresses use the first two octets for the network ID. Therefore, the subnet mask is 255.255.0.0. All other answers are incorrect. 255.0.0.0 is the default subnet mask for a Class A address. 255.255.255.0 is the default subnet mask for a Class C address. 169.254.1.1 is an APIPA address, and you cannot access valid addresses from DHCP servers. With this address, you cannot communicate with others on the network."
  },
  {
    "ground_truth_id": 101,
    "explanation": "A home network is more likely to have a Wireless Access Point (WAP) as a home router. All other answers are incorrect. Hubs join multiple hosts together but very slowly. A router is an enterprise product that joins networks together and is normally used in enterprise settings. Switches join multiple internal hosts together more quickly than a hub. 128 Solutions"
  },
  {
    "ground_truth_id": 102,
    "explanation": "212.15.1.2 is a valid IPv4 address. All other answers are incorrect. 10.1.1.0 cannot be used for a host as it ends in 0, indicating that it is a network address. Any address starting with 255 is a subnet mask and cannot be used for a host. 12.1.1.255 cannot be used as a host as it ends in 255, indicating that it is the broadcast address."
  },
  {
    "ground_truth_id": 103,
    "explanation": "A Windows server that uses both IPv4 and IPv6 addresses is known as dual stack. All other answers are incorrect. 8. The correct answers are A and D. A desktop may be allocated a 169.254.x.x address either because it is an Automated Private IP Address (APIPA) assigned due to a duplicate IP address or (most commonly) it is unable to get network connectivity to the DHCP server. All other answers are incorrect. A DNS server is used for hostname-to-IP-address resolution. A domain controller is used for authentication."
  },
  {
    "ground_truth_id": 104,
    "explanation": "The default gateway is missing, and this prevents the user from leaving the internal network. A default gateway is required to access the internet. All other answers are incorrect. If the gateway was present, then DNS might be an issue with the same scenario, but this is not the case. 132.24.0.1 is a public Class B address and therefore can get onto the internet. You would need to run ipconfig /all to determine whether the IP address is dynamic or static."
  },
  {
    "ground_truth_id": 105,
    "explanation": "An IPv4 address has 4 octets of 8, making it a 32-bit addressing schema. All other answers are incorrect."
  },
  {
    "ground_truth_id": 106,
    "explanation": "2001:0dC8:0000:0000:0abc:0000:def0:2311 is an IPv6 address. All other answers are incorrect. 10.1.1.1 is a private IPv4 address. B4-2E-99-C0-75-45 is a MAC address. 169.254.1.5 is an APIPA address used to contact the DHCP server or results from a duplicate IP address being allocated."
  },
  {
    "ground_truth_id": 107,
    "explanation": "If you cannot access the internet, it is most likely to be the router’s gateway or a DNS problem. All other answers are incorrect. NETBIOS is a legacy naming convention. Server Message Block (SMB) traffic is a communication protocol that allows access to file shares and printers. SMTP is used to transfer mail between mail servers."
  },
  {
    "ground_truth_id": 108,
    "explanation": "When you shorten an IPv6 address, you remove the leading zeros. Therefore, Odc8 becomes dc8. Then you look at the third and fourth octets, which are 0000:0000. This can be replaced by ::. You know there are 8 octets, so when you count six remaining, you know 0000:0000 is missing. You then take 0abc and remove the leading zero, leaving abc. The sixth octet is 0000, but you cannot use :: again, so you reduce it to :0:. Thus, the shortened IPv6 address becomes 2001:dC8::abc:0:def0:2311. All other answers are incorrect."
  },
  {
    "ground_truth_id": 109,
    "explanation": "126.1.1.1 is a public IPv4 address. All other answers are incorrect. The IPv4 addresses 10.10.10.1, 172.16.1.3, and 192.168 are all private. Any addresses starting with 10, 172.16-172.31, or 192.168 are private and cannot be used externally."
  },
  {
    "ground_truth_id": 110,
    "explanation": "An IPv6 address has 64 bits for the network ID and 64 bits for the interface ID, making it a 128-bit addressing schema. All other answers are incorrect. IPv4 uses 32-bit addressing. Chapter 2: Networking 129 2.6 Compare and contrast common network configuration concepts"
  },
  {
    "ground_truth_id": 111,
    "explanation": "It is most likely that the financial director has an APIPA, and that is why they cannot connect to anyone else. Check to see whether the DHCP server has allocated an IP address. All other answers are incorrect. Simple Network Management Protocol (SNMP) monitors the status of and creates reports on network devices. RADIUS is an AAA server that controls access to the network, but the administrator is already on the network. A DNS server translates host names to IP addresses."
  },
  {
    "ground_truth_id": 112,
    "explanation": "The address above is an IPv6 address and needs an AAA record. All other answers are incorrect. An A record is used for an IPv4 host. An MX record is used by a mail server. A TXT record is used for any free-form record such as an SPF record."
  },
  {
    "ground_truth_id": 113,
    "explanation": "A Microsoft Dynamic Host Configuration Protocol (DHCP) server has a default lease duration of 8 days. All other answers are incorrect."
  },
  {
    "ground_truth_id": 114,
    "explanation": "An MX record is used for mail servers. All other answers are incorrect. An A record is used for an IPv4 host. An AAA record is used for an IPv6 host. SRV records are used to find services such as domain controllers."
  },
  {
    "ground_truth_id": 115,
    "explanation": "A Local Area Network (LAN) is an internal secure network. All other answers are incorrect. A Wide Area Network (WAN) spans multiple geographical locations. A Metropolitan Area Network (MAN) is used by the police, ambulance, and fire services in a city. CAN refers to a campus area network used in academic institutions."
  },
  {
    "ground_truth_id": 116,
    "explanation": "With DomainKeys Identified Mail (DKIM), an organization uploads a public key as a TXT record. The authenticity of the originating servers of incoming messages can be verified using this key. All other answers are incorrect. SPF uses a TXT record to indicate that a host from a particular domain is allowed to send mail. A syslog centralizes the log files from many servers."
  },
  {
    "ground_truth_id": 117,
    "explanation": "With a DHCP reservation, an IP address is reserved for a host as identified by their MAC address. All other answers are incorrect. A DHCP scope refers to the addresses that a DHCP server can allocate for a particular subnet. IP address lease durations cannot be customized; everyone gets the same lease duration. If a client has a static address that is manually configured, the host will not send out a DHCPDISCOVER packet to try and obtain an address from DHCP."
  },
  {
    "ground_truth_id": 118,
    "explanation": "A Virtual Local Area Network (VLAN) is normally used for departmental isolation or isolation within a LAN. All other answers are incorrect. A proxy server controls access from the internal network to an external network. A firewall is used to control access between the internal and external networks. A router joins multiple external networks together. 130 Solutions"
  },
  {
    "ground_truth_id": 119,
    "explanation": "DMARC can validate incoming email messages and has the ability to detect and prevent email spoofing. Therefore, any emails arriving from an illegitimate source can be blocked. All other answers are incorrect. A content filter is used by a proxy server or UTM firewall to prevent anyone from accessing a website (such as a gambling site) that has inappropriate content. A proxy server controls outgoing requests and has the ability to cache website content. It can also carry out URL or content filtering by blocking access to websites hosting inappropriate content."
  },
  {
    "ground_truth_id": 120,
    "explanation": "A Dynamic Host Configuration Protocol (DHCP) scope is a range of IP addresses that can be allocated to a subnet. All other answers are incorrect. In a DHCP reservation, the same IP address can be allocated to the same host as identified by their MAC address. A DHCP lease refers to the limited time that a host is allocated an IP address. A DHCP superscope allows two or more scopes to be used as if they were a single scope to increase the number of IP addresses in a subnet."
  },
  {
    "ground_truth_id": 121,
    "explanation": "131.122.14.12 is an IPv4 address and therefore uses an A record. All other answers are incorrect. An AAA record is used for an IPv6 host. An MX record is used for mail servers. A Sender Policy Framework (SPF) record is used to prove the authenticity of mail servers to prevent spam."
  },
  {
    "ground_truth_id": 122,
    "explanation": "The DHCP handshake sequence is DISCOVER, OFFER, REQUEST, ACK (normally known as DORA). The host sends a DHCPDISCOVER broadcast packet to find a DHCP server. The DHCP server replies with DHCPOFFER containing an IP address along with other configuration, such as the DNS server and the default gateway. The client then replies with DHCPREQUEST to accept the offer. The DHCP server then sends a DHCPACK packet confirming the allocation of the IP address with a lease time of 8 days, normally. All other answers are incorrect."
  },
  {
    "ground_truth_id": 123,
    "explanation": "A Virtual Private Network (VPN) creates a secure tunnel between an external location and the corporate network. All other answers are incorrect. A WAN is an external network (e.g., the internet). SSL is a method of encrypting data in transit, normally via a web browser. DHCP dynamically allocates IP addresses to hosts. 14. The correct answers are B, C, and D. Each company should have one SPF record in the DNS as a TXT file that identifies the hosts that are authorized to send mail. DKIM uses cryptographic keys to verify that the mail server sending the email is authorized to do so. DMARC detects and protects against email spoofing. The remaining answer is incorrect. A stateless firewall is a very basic packet-filtering firewall. Chapter 2: Networking 131 2.7 Compare and contrast internet connection types, network types, and their features"
  },
  {
    "ground_truth_id": 124,
    "explanation": "The internet is a Wide Area Network (WAN), due to the large geographical area it covers. All other answers are incorrect. A Metropolitan Area Network (MAN) (such as one used by police) is a network that covers a city. A Personal Area Network (PAN) is used by a single person, for example, Bluetooth. A Local Area Network (LAN) LAN is a network confined to a single location (this could be an entire building or even a single room) connected by one or more switches."
  },
  {
    "ground_truth_id": 125,
    "explanation": "Satellite phones are the only method that are able to communicate in remote areas. All other answers are incorrect. A cable modem would not work as there are no cables to connect to. GPS is used for navigation, and only works via satellite. There would not be any wireless access point up a mountain in a remote location."
  },
  {
    "ground_truth_id": 126,
    "explanation": "Fiber-optic cabling works on light pulses, is immune to EMI, and is very secure. All other answers are incorrect. Coax has many layers that protect against emitting EMI, but, as a hacker could attach a vampire tap and connect to the cable, it is not secure. It is also very slow. Because of the foil layers, STP can reduce EMI but is not as fast as fiber. 10-BASE-T is a legacy Ethernet-cable version and can be UTP or STP. However, it is quite slow (10Mbps)."
  },
  {
    "ground_truth_id": 127,
    "explanation": "An iPhone 11 is a smartphone that uses cellular communication (hence the term “cellphone”). All other answers are incorrect. DSL is used to provide internet in a SOHO. An iPhone 11 can use a wireless connection, but this is not the main connection type. An iPhone is not a satellite communication device. 5. The correct answers are B and C. A WISP connects customers and service providers using long- range fixed wireless technology. All other answers are incorrect. A WISP does not manufacture modem wireless access points nor monitor bandwidth."
  },
  {
    "ground_truth_id": 128,
    "explanation": "A Wide Area Network (WAN) is an unsecure network over a large geographical area. All other answers are incorrect. A LAN is a secure fast network with its users all in close proximity, such as a single floor in a building. A DMZ is a boundary network that sits between the LAN and the WAN. As two of these statements are false, “All of the above” is also incorrect."
  },
  {
    "ground_truth_id": 129,
    "explanation": "A Dynamic Host Configuration Protocol (DHCP) server automatically assigns IP addresses on machine startup. It allows an administrator to create a reservation based on the user’s MAC address, ensuring that this particular host gets the IP address to be monitored. All other answers are incorrect. SMTP is used for email and not IP addresses. SSL refers to secure data in transit via a web browser. A DNS server is used to perform hostname- to-IP-address name resolution."
  },
  {
    "ground_truth_id": 130,
    "explanation": "A Wireless Local Area Network (WLAN) is used to connect multiple devices wirelessly. All other answers are incorrect. A PAN is one individual network connecting two devices together, such as the Bluetooth connection between a user’s earbuds and a smartphone. A WAN is a network over a large geographical area. 132 Solutions"
  },
  {
    "ground_truth_id": 131,
    "explanation": "A Digital Subscriber Line (DSL) uses telephone lines as a communication channel. All other answers are incorrect. Satellite communication is not reliant on telephones. Neither fiber nor cable modems use telephone lines either. 2.8 Given a scenario, use networking tools"
  },
  {
    "ground_truth_id": 132,
    "explanation": "A loopback plug is used to test a network card or switch port. If you get a solid LED, this then tells you that the port or network card can send and receive data. All other answers are incorrect. Pliers would cut through the cable and are better used to firmly grip objects. A cable stripper scores the jacket of a cable and makes it easy to remove. A punch- down tool is used to terminate wires in the back of the patch panel to the IDC."
  },
  {
    "ground_truth_id": 133,
    "explanation": "A cable stripper scores the jacket of a cable and makes it easy to remove. All other answers are incorrect. A crimping tool is used to connect an RJ45 plug to a cable. Pliers would cut through the cable and are better used to firmly grip objects. A loopback plug is used to test network cards and switch ports to confirm whether they can send and receive data."
  },
  {
    "ground_truth_id": 134,
    "explanation": "A punch-down tool is used to push wires into the IDC. All other answers are incorrect. A crimping tool is used to connect an RJ45 plug to a cable. A cable stripper is used to score the jacket so that it can easily be removed. A cable tester can be attached to both ends of a cable to test the permanent link."
  },
  {
    "ground_truth_id": 135,
    "explanation": "A toner probe can trace an RJ45 cable to the patch panel. All other answers are incorrect. A crimping tool is used to connect the RJ45 connector to an Ethernet cable. A punch-down tool is used to fix each conductor into an IDC. An OTDR is used to analyze faults in a fiber cable."
  },
  {
    "ground_truth_id": 136,
    "explanation": "A network tap allows you to divert network traffic to a secondary device for analysis. All other answers are incorrect. A loopback plug is used to test a network card or switch port. A spectrum analyzer analyzes the input signal against a frequency range within a wireless network. A toner probe can trace an RJ45 cable to the patch panel."
  },
  {
    "ground_truth_id": 137,
    "explanation": "A crimping tool is used to seal the RJ45 into either a T568A or B layout. All other answers are incorrect. A punch-down tool is used to terminate wire pairs into the IDC blocks. A cable stripper is used to score the outer jacket from a cable just enough to allow it to be removed to expose the cable. Pliers are used to firmly grip an object."
  },
  {
    "ground_truth_id": 138,
    "explanation": "A Wi-Fi analyzer is a piece of software that can be installed on a laptop. It will detect any other wireless access points in the vicinity and record the signal strength of the different networks using each channel. All other answers are incorrect. A protocol analyzer will collect packets traveling across the network. A bandwidth monitor measures the available bandwidth on a network. RFID detects objects by using tags, commonly used on high-value items in shops."
  },
  {
    "ground_truth_id": 139,
    "explanation": "A cable tester is connected to each end of a cable and tests each wire in turn and a successful connection will show an LED light. All other answers are incorrect. A loopback plug is used to test a network card or switch port. A bandwidth monitor measures the available bandwidth on a network. An OTDR is used to test fiber-optic cables for faults. Chapter 3: Hardware 133 Chapter 3: Hardware 3.1 Explain basic cable types and their connectors, features, and purposes"
  },
  {
    "ground_truth_id": 140,
    "explanation": "Copper cables are subject to signal attenuation, which refers to the loss of signal strength over distance. Copper cables can be susceptible to electromagnetic interference. This will reduce speed but is not the main limitation. Bandwidth limitation primarily affects the overall capacity of the network but does not directly impact the speed of data transmission. Insulation-related issues are more likely to cause signal quality problems rather than limiting the speed of data transmission."
  },
  {
    "ground_truth_id": 141,
    "explanation": "An Optical Time Domain Reflectometer (OTDR) is a tool used for troubleshooting and testing fiber optic cables. It sends light pulses into the cable and measures the reflections to identify any issues, such as breaks or signal loss. Wire cutters are used for cutting wires and not troubleshooting fiber optic cables. An Ethernet cable tester is used to verify the connectivity and quality of Ethernet cables. A multimeter is used for measuring voltage, current, and resistance in electrical circuits."
  },
  {
    "ground_truth_id": 142,
    "explanation": "ST connectors are typically used with single-mode fiber cables. Their key benefit is low signal loss, not high data rates. Multi-mode fiber is used for high data rates. They use an ST connector that has a bayonet-style design, and they are easy to install. For high- density networks, LC (Lucent Connector) connectors are commonly used. LC connectors are small form factor connectors that offer high-density connectivity while maintaining excellent performance. Coaxial cables are compatible with various connectors and devices, making them versatile for different applications. They can be easily connected to devices such as TVs, modems, routers, antennas, and video cameras."
  },
  {
    "ground_truth_id": 143,
    "explanation": "Cat 5 cables are designed for Ethernet networking and have a maximum distance limitation of 100 meters. All other options are beyond the 100 m limitation."
  },
  {
    "ground_truth_id": 144,
    "explanation": "A punch-down tool is used to connect wires to the demarc securely. A wire stripper removes insulation from wires. A cable tester verifies cable connectivity and quality but is not specifically used for adding lines to the demarc. A crimping tool is used to attach connectors to cables, but not specifically for adding lines to the demarc."
  },
  {
    "ground_truth_id": 145,
    "explanation": "RJ11 connectors are used for telephony applications to connect telephone handsets to wall jacks. RJ11 connectors are not typically used for connecting computers to routers. Printers are usually connected to computers using USB cables, not RJ11 connectors. Connecting a TV to a cable box typically involves HDMI or coaxial cables, not RJ11 connectors."
  },
  {
    "ground_truth_id": 146,
    "explanation": "Cat 5 cables can support a maximum data transmission speed of 100 Mbps. Cat 5e can run at 1 Gbps. Cat 6 runs at 1 Gbps and Cat 8 runs at 40 Gbps. 134 Solutions"
  },
  {
    "ground_truth_id": 147,
    "explanation": "Thunderbolt cables are commonly used in Apple’s macOS systems for high-speed data transfer and device connectivity. Windows is commonly associated with a wireless or Ethernet connection. Linux is associated with Ethernet cables. Android uses micro-USB or USB-C connections."
  },
  {
    "ground_truth_id": 148,
    "explanation": "A crimping tool is commonly used to create an RJ45 cable. It is used to attach the RJ45 connectors to the ends of Ethernet cables, ensuring secure and reliable connections. A wire stripper removes insulation from wires. A punch-down tool is used to connect wires to the demarc. A multimeter is used for measuring voltage, current, and resistance in electrical circuits."
  },
  {
    "ground_truth_id": 149,
    "explanation": "Lightning to USB cables are commonly used for charging iPhones and other Apple devices. Printers usually require specific printer cables or USB cables with different connectors. A crossover cable is used to transfer data between two computers. Display cables, such as HDMI or DisplayPort cables, are typically used for connecting monitors to laptops or other devices."
  },
  {
    "ground_truth_id": 150,
    "explanation": "A crossover cable where we are connecting two similar devices (e.g., a computer to a computer or a switch to a switch). Straight-through cables typically have the same wiring scheme (either T568A or T568B) on both ends, not a combination of both. Coaxial cables typically use BNC (Bayonet Neill–Concelman) or F-type connectors. BNC connectors are commonly used in professional video and networking applications, while F-type connectors are predominantly used in television and consumer audio/video systems. Fiber optic cables use different connectors, such as SC, ST, or FC connectors."
  },
  {
    "ground_truth_id": 151,
    "explanation": "USB offers a speed of 12 Mbps, while USB 2 offers a speed of 480 Mbps. They do not have the same speed: USB (USB 1.1) has a lower speed of 12 Mbps, while USB 2.0 offers a higher speed of 480 Mbps. USB and USB 2 are specific versions of the USB standard with defined speeds."
  },
  {
    "ground_truth_id": 152,
    "explanation": "Plenum-grade cables have fire-resistant properties to meet the stringent safety regulations in air-handling spaces. Plenum-grade cables are not primarily designed for outdoor use. While plenum-grade cables can support high-speed data transfer, it is not their primary use case. While plenum-grade cables can be used for long-distance connections, their main advantage lies in specific environments rather than distance capabilities."
  },
  {
    "ground_truth_id": 153,
    "explanation": "The metallic shielding around STP cables helps prevent EMI from interfering with the transmitted signals. STP cables are not specifically designed for outdoor use. STP cables can support lengths of up to 100 meters (328 feet) for Ethernet applications, making them unsuitable for long distances. You would never use STP cables in a low electromagnetic interference (EMI) environment."
  },
  {
    "ground_truth_id": 154,
    "explanation": "F-type connectors are a type of coaxial connector commonly used for cable television (CATV) and other video or audio applications. Ethernet network connections use an RJ45 cable. Fiber optic networks typically use different types of connectors, such as SC or LC connectors. Wi-Fi devices, such as routers and access points, use integrated antennas or external antenna connectors to establish wireless connections with other devices. Chapter 3: Hardware 135"
  },
  {
    "ground_truth_id": 155,
    "explanation": "Wire cutters are used to strip the outer sheath of the cable, then we insert the cable into an RJ45 connector and use the crimper to terminate Ethernet cables with RJ45 connectors. All other options are wrong."
  },
  {
    "ground_truth_id": 156,
    "explanation": "LC connectors are known for their small form factor and high density, making them commonly used in data centers and other environments where space is a concern. While SC connectors are widely used in fiber optic networks, they do not provide a higher density compared to LC connectors. ST connectors are older and larger connectors, not known for their high density. FC connectors, similar to ST connectors, are larger and not known for their high density. They are primarily used in specialized applications, such as high-power or industrial settings."
  },
  {
    "ground_truth_id": 157,
    "explanation": "eSATA (External Serial Advanced Technology Attachment) is specifically designed for connecting external storage devices, such as hard drives, to a computer at speeds of 6 Gbps. USB 2.0 (Universal Serial Bus 2.0) has a maximum data transfer speed of 480 Mbps. HDMI (High-Definition Multimedia Interface) is primarily used for connecting audio-visual devices, such as monitors and TVs, and not storage. VGA (Video Graphics Array) is an older interface primarily used for connecting monitors or projectors for video display."
  },
  {
    "ground_truth_id": 158,
    "explanation": "DisplayPort supports simultaneous video and audio transmission over a single cable, making it convenient for connecting monitors with audio capabilities. DisplayPort does not work with a wide range of older display devices. DisplayPort could be more expensive than other interfaces. 3.2 Install the appropriate RAM given a scenario"
  },
  {
    "ground_truth_id": 159,
    "explanation": "The primary purpose of virtual RAM is to improve system performance by extending the available memory. It allows the computer to use a portion of the hard drive or SSD as additional RAM when the physical RAM becomes insufficient. Virtual RAM’s purpose is not to provide additional storage for files and documents. Virtual RAM serves as an extension of the available memory, rather than a backup solution. Virtual RAM has nothing to do with CPU and GPU."
  },
  {
    "ground_truth_id": 160,
    "explanation": "The primary reason for using DDR RAM in computer systems is its improved data transfer rates. DDR RAM enables data transfer on both the rising and falling edges of the clock signal, effectively doubling the transfer rate compared to earlier memory technologies. This boost in speed enhances system performance and responsiveness. DDR RAM is not used for increasing storage capacity in computer systems. DDR RAM is not used for power efficiency; the main reason is increased data transfer rates. DDR RAM can contribute to reducing latency to some extent; its primary purpose is to enhance data transfer rates. 136 Solutions"
  },
  {
    "ground_truth_id": 161,
    "explanation": "SODIMM RAM (Small Outline Dual Inline Memory Module) is the type of memory module commonly used in laptops and small form factor computers due to its compact size. DIMM RAM (Dual Inline Memory Module) is a larger form factor memory module typically used in desktop computers. RIMM RAM (Rambus Inline Memory Module) is an older memory module type that was used in high-end workstations or servers that demanded high-speed memory access and data transfer rates. MicroDIMM RAM is a smaller variant of DIMM RAM commonly found in specialized or niche devices."
  },
  {
    "ground_truth_id": 162,
    "explanation": "ECC RAM is designed to detect and correct memory errors, improving data integrity. ECC RAM is not specifically designed to provide faster data transfer between the CPU and RAM. Its main focus is error detection and correction rather than improving transfer speeds. ECC RAM does not enhance graphics processing capabilities. ECC RAM does not increase the storage capacity of RAM."
  },
  {
    "ground_truth_id": 163,
    "explanation": "The primary benefit of using dual-channel RAM is faster data transfer rates. It utilizes two differently colored memory slots, allowing for parallel data access and improving overall system performance. Typically, a black slot and a contrasting color such as blue, gray, or white, depending on the manufacturer. Dual-channel RAM does not directly increase the storage capacity of the RAM. Dual-channel RAM does not directly improve graphics performance. Dual-channel RAM does not specifically lower power consumption."
  },
  {
    "ground_truth_id": 164,
    "explanation": "The primary advantage of using quad-channel RAM is improved data transfer rates. It utilizes four memory channels simultaneously, allowing for increased bandwidth and faster data transfer between the RAM and the CPU. Quad-channel RAM does not have any effect on storage. While quad-channel RAM can offer some benefits for multitasking scenarios, it is not its primary advantage. Memory latency is more influenced by factors such as memory speed and timings."
  },
  {
    "ground_truth_id": 165,
    "explanation": "DDR2 goes from 400 to 1,066 MHz, DDR3 goes from 800 to 2,133 Mhz, and DDR4 goes from 2,133 to 3,200 MHz. All other options are wrong."
  },
  {
    "ground_truth_id": 166,
    "explanation": "The combination of an SSD, Intel Core i7 CPU, and 16 GB DDR4 RAM is the best choice for a gaming PC due to faster storage access, high-performance processing capabilities, and ample memory capacity. SSD, Intel Core i5, 8 GB DDR4, offers a good balance, but a higher-end CPU such as the Intel Core i7 is preferred for gaming. 16 GB of DDR4 RAM provides a more comfortable gaming experience. An SSD is preferred over an HDD for faster loading times, while AMD Ryzen 3 CPUs and DDR3 RAM are less powerful options compared to the others for gaming purposes. Chapter 3: Hardware 137 3.3 Given a scenario, select and install storage devices"
  },
  {
    "ground_truth_id": 167,
    "explanation": "The primary advantage of installing an M.2 hard drive directly on the motherboard without cables is the simpler and more secure connection. It eliminates the need for extra cables and reduces clutter within the system. Faster data transfer rates are not the main advantage. The IDE is an older interface used for traditional hard drives and optical drives, and it does not apply to M.2 drives. Increased storage capacity is not the primary advantage of installing M.2 drives without cables."
  },
  {
    "ground_truth_id": 168,
    "explanation": "1 TB NVMe SSDs offer significantly faster data transfer rates compared to traditional hard drives, such as SATA SSDs or HDDs. They provide improved performance, lower latency, and faster access times, making them the optimal choice for maximizing speed. eSATA is not used as a hard drive but it is used for external storage. A USB 3.0 flash drive will not be used as a hard drive but is slower than NVMe SSD. A 1 TB SATA SSD is not as fast as an NVMe SSD."
  },
  {
    "ground_truth_id": 169,
    "explanation": "Slower rotational speeds of 5,400 rpm result in slower data access and transfer rates due to the increased time taken by the read/write head to locate and access data on the spinning disk. 7,200 rpm, 10,000 rpm, and 15,000 rpm are all faster than 5,400 rpm."
  },
  {
    "ground_truth_id": 170,
    "explanation": "Flash drives, commonly known as USB drives are used for portable storage due to their convenience and ease of use. Memory cards are also used for portable data storage. Optical drives are used for reading or writing optical disks. Hard disk drives are used internally in the system."
  },
  {
    "ground_truth_id": 171,
    "explanation": "When selecting a motherboard for a specific CPU, a critical consideration is ensuring socket compatibility. The CPU socket on the motherboard must match the socket type of the CPU for proper physical and electrical connections. Memory type support is important but not critical, but it will tell you how much and what type of memory the motherboard supports. Expansion slot availability is important for adding additional components, but it is not critical. Form factor compatibility ensures that the motherboard fits into the computer case, but it is not the main factor when choosing a motherboard for a specific CPU."
  },
  {
    "ground_truth_id": 172,
    "explanation": "Optical drives, such as CDs or DVDs, are used for reading or writing optical disks. Flash drives use solid-state memory and do not rely on laser technology for reading and writing data. Memory cards, such as SD or microSD cards, also do not use laser technology for data storage. SSDs use flash memory technology for data storage and do not require laser technology for data access."
  },
  {
    "ground_truth_id": 173,
    "explanation": "A SATA cable has a small, L-shaped connector at one end and a flat connector at the other end. A wide, rectangular connector at both ends would be an IDE cable. An audio/video cable would be a round, barrel-shaped connector at one end and a flat connector at the other end. A triangular-shaped connector at one end could be a DisplayPort cable or an HDMI cable. 138 Solutions"
  },
  {
    "ground_truth_id": 174,
    "explanation": "HDDs with 15,000 rpm are used in specialized enterprise environments requiring high-performance storage due to their faster data access and transfer rates. However, they may generate more heat and noise compared to HDDs with lower rotational speeds, such as 5,400 rpm, 7,200 rpm, or 10,000 rpm."
  },
  {
    "ground_truth_id": 175,
    "explanation": "RAID 5 uses a minimum of three drives, which distributes data and parity across the drives, providing both data redundancy and increased storage capacity. RAID 0 does not provide data redundancy and would not be suitable for ensuring data protection in this case. RAID 1, which mirrors the data across the drives only uses two drives. RAID 10, which combines striping and mirroring, would require a minimum of four drives to implement."
  },
  {
    "ground_truth_id": 176,
    "explanation": "PCIe is commonly used for connecting high-speed graphics cards in computer hardware. It provides a high-bandwidth interface that enables fast communication between the graphics card and the motherboard. This allows for optimal performance and rendering of complex graphics, resulting in enhanced gaming experiences and improved graphics-intensive applications. All other options are incorrect. 11. The correct answers are A and D. RAID 6 uses a minimum of four drives, which distributes data and parity across the drives, providing both data redundancy and increased storage capacity. RAID 10 also uses a minimum of four drives, which combines striping and mirroring, providing both data redundancy and increased storage capacity. RAID 0 does not provide data redundancy and would not be suitable for ensuring data protection in this case. RAID 5 requires a minimum of three drives."
  },
  {
    "ground_truth_id": 177,
    "explanation": "RAID 1, also known as mirroring, duplicates the data across the two drives, providing redundancy in case one drive fails and the other drive takes over. RAID 0, also known as striping, does not provide data redundancy. RAID 5 needs a minimum of three drives and RAID 10 a minimum of four drives."
  },
  {
    "ground_truth_id": 178,
    "explanation": "Memory cards, such as SD or microSD cards, can be used for data storage. Flash drives can be used in digital cameras and smartphones, but memory cards are a much better option. Optical drives are not used in digital cameras and smartphones. SSDs are used in various devices, including computers and laptops, but are not used as expansion storage in digital cameras and smartphones."
  },
  {
    "ground_truth_id": 179,
    "explanation": "M.2 NVMe SSDs provide the fastest data access speeds for laptops. They utilize the NVMe interface and offer significantly faster performance compared to other SSD options. 2.5” SAS HDDs provide high reliability and integrity and are not the best choice for achieving the fastest data access. IDE HDDs are slow legacy hard drives. mSATA SSDs offer faster data access but are slower than M.2 NVMe SSDs. Chapter 3: Hardware 139"
  },
  {
    "ground_truth_id": 180,
    "explanation": "The main difference between a 2.5” SSD and a 3.5” SSD is their physical form factor and size. A 2.5” SSD is smaller and commonly used in laptops and small form factor desktops, while a 3.5” SSD is larger and typically intended for use in traditional desktop computers. This size difference affects their compatibility with drive bays and installation methods. Both 2.5” and 3.5” SSDs typically operate with the same power. The data transfer speed of an SSD is not directly related to its physical size. 2.5” and 3.5” SSDs determine their compatibility with different drive bays, but this is not the key difference between them. The form factor primarily affects their physical dimensions and installation options. 3.4 Given a scenario, install and configure motherboards, central processing units (CPUs), and add-on cards"
  },
  {
    "ground_truth_id": 181,
    "explanation": "NVMe SSDs require a specific NVMe-compatible motherboard with an M.2 slot. All other options are incorrect."
  },
  {
    "ground_truth_id": 182,
    "explanation": "x86 architecture, also known as 32-bit processors, has a maximum addressable memory limit of 4 GB. 2 GB is incorrect as it underestimates the maximum RAM capacity. x64 architecture, also known as 64-bit processors can address memory higher than 4 GB."
  },
  {
    "ground_truth_id": 183,
    "explanation": "In the BIOS settings, ensure that the desired operating system is set as the first boot option. All other options are incorrect as they are unrelated to boot option troubleshooting."
  },
  {
    "ground_truth_id": 184,
    "explanation": "Heat sinks and fans are essential components in desktop computers to dissipate heat generated by the CPU. As the CPU performs computations, it generates heat, and if not properly managed, it can lead to overheating. Heat sinks are designed to absorb and disperse the heat away from the CPU, while fans provide airflow to carry the heat away from the heat sink. Heat sinks and fans do not focus on power consumption, speed of data transfer, or EMI."
  },
  {
    "ground_truth_id": 185,
    "explanation": "The ITX form factor is commonly chosen when building a compact and portable gaming PC. The small size of ITX motherboards allows for a more compact system build, making it easier to transport and suitable for LAN parties or gaming on the go. Other options are not ideal scenarios for using an ITX form factor. They typically require motherboards with more expansion slots and connectivity options."
  },
  {
    "ground_truth_id": 186,
    "explanation": "The primary advantage of liquid cooling over air cooling is improved thermal efficiency. Liquid cooling systems, such as all-in-one (AIO) coolers or custom loops, are designed to effectively dissipate heat from the components, resulting in lower temperatures compared to air cooling. This enhanced thermal efficiency allows for better overclocking potential and overall improved performance of the system. All other options are incorrect. 140 Solutions"
  },
  {
    "ground_truth_id": 187,
    "explanation": "Performing a TPM reset clears the previous encryption key stored in the TPM and establishes a fresh secure connection with the upgraded hardware, allowing the system to boot and regain access to the stored data. Disabling the TPM functionality in the BIOS may prevent the system from accessing the encrypted key required to decrypt the data. Reverting to the previous hardware configuration might not be practical or necessary, and it does not address the issue of the TPM encryption key."
  },
  {
    "ground_truth_id": 188,
    "explanation": "A clicking noise during computer bootup may indicate a failing hard drive with mechanical issues such as a malfunctioning read/write head or a failing spindle motor. Promptly backing up the data and replacing the failing hard drive is crucial to prevent data loss. An overheating CPU can cause the computer to shut down. A loose power cable might result in power loss. A malfunctioning graphics card is not related to a clicking noise."
  },
  {
    "ground_truth_id": 189,
    "explanation": "The 8-pin EPS connector is commonly used to provide dedicated power to the CPU on a desktop motherboard. It ensures stable and sufficient power delivery to meet the high power demands of modern CPUs. The 4-pin Molex connector is commonly used for connecting fans and cooling devices. The 6-pin PCIe connector is used to provide supplementary power to PCIe expansion cards, such as graphics cards. The 24-pin ATX connector is the primary power connector for the motherboard."
  },
  {
    "ground_truth_id": 190,
    "explanation": "Operating a disk infrastructure in a degraded state increases the risk of data loss. When one or more disks in the infrastructure are degraded or experiencing issues, the system relies on the remaining disks to maintain data integrity. All other options are wrong."
  },
  {
    "ground_truth_id": 191,
    "explanation": "If the CPU fan fails to function properly, it can result in inadequate cooling of the CPU. As a consequence, the CPU may overheat, which can lead to system instability, unexpected shutdowns, or even permanent damage to the CPU. Proper cooling is essential for maintaining the CPU’s optimal temperature and ensuring its reliable operation. The CPU’s performance may decrease but it is not the primary reason. All other options are incorrect."
  },
  {
    "ground_truth_id": 192,
    "explanation": "A continuous beep from a computer typically indicates a RAM failure or a compatibility issue. If the CPU is not properly seated in its socket, you may encounter an error such as a “CPU Fan Error” or a “No POST” (Power-On Self-Test) error. Power-related issues will result in experiencing intermittent power loss, sudden shutdowns, or power failure."
  },
  {
    "ground_truth_id": 193,
    "explanation": "The main difference between AT and ATX motherboards is their size and form factor. Other options that are differences but not the main difference are AT is considered legacy where motherboards are larger in size, while ATX motherboards are smaller and more commonly used in modern computer systems. ATX motherboards introduced improvements such as better component placement, standardized I/O ports, and improved power management. AT uses a single power supply whereas ATX uses a 20/24-pin connector. ATX supports more expansion slots compared to AT. ATX supports DDR4 RAM while AT supports the older DDR3 RAM. Chapter 3: Hardware 141"
  },
  {
    "ground_truth_id": 194,
    "explanation": "When a heat sink is not working optimally, it is recommended to check for dust accumulation and clean the heat sink, as dust can obstruct airflow. Additionally, replacing the thermal paste between the CPU and heat sink helps ensure efficient heat transfer. Finally, ensuring proper contact between the CPU and heat sink is crucial for effective heat dissipation."
  },
  {
    "ground_truth_id": 195,
    "explanation": "The technician should use the BitLocker Drive Encryption tool to unlock and access the encrypted USB drive. By entering the decryption key or password in the BitLocker Drive Encryption settings, the drive can be unlocked, allowing authorized access to the files stored on it while ensuring data security. Disk Clean-up is a tool used to free up disk space by removing unnecessary files. Windows Defender Firewall is responsible for network traffic filtering and protection against unauthorized access. Task Scheduler is used to automate tasks and launch programs at specified times or events."
  },
  {
    "ground_truth_id": 196,
    "explanation": "To prevent unauthorized booting from a CD, implement secure boot. Secure boot ensures that only trusted and digitally signed operating systems can be booted, preventing the use of unauthorized live CDs. All other options are important security measures but they do not directly address the specific scenario of booting from a live Linux CD."
  },
  {
    "ground_truth_id": 197,
    "explanation": "Use a power supply with a higher wattage. If plugging in a device causes the power to the PC to go down, it indicates that the current power supply is not providing enough wattage to support the additional power demands of the device. By upgrading to a power supply with a higher wattage, you can ensure that your PC has sufficient power to handle the device and other components without experiencing power interruptions. All other options are incorrect."
  },
  {
    "ground_truth_id": 198,
    "explanation": "When a CPU runs hot due to worn thermal paste, it can lead to system instability and crashes. High temperatures can cause the CPU to perform slowly and trigger thermal protection mechanisms, resulting in system instability and unexpected shutdowns to prevent damage from excessive heat. Other options are potential concerns associated with high CPU temperatures; they are not directly caused by worn thermal paste."
  },
  {
    "ground_truth_id": 199,
    "explanation": "Increasing the RAM capacity improves the system performance when using multiple applications simultaneously. RAM acts as temporary storage for active applications, enabling efficient management and access to data. More RAM allows applications to operate without frequent data swapping, enhancing system responsiveness. Close unnecessary background processes and applications will not improve performance drastically. Installing a faster SSD (Solid-State Drive) can enhance storage performance and application loading times but may not specifically address multitasking performance. Increasing the CPU clock speed can improve application performance, but it may not be the most efficient solution when dealing with multiple applications simultaneously, as it may lead to increased heat generation and power consumption."
  },
  {
    "ground_truth_id": 200,
    "explanation": "The Molex connector is primarily used for connecting fans and cooling devices. It provides power to the fans and allows for speed control and monitoring. All other options are incorrect. 142 Solutions"
  },
  {
    "ground_truth_id": 201,
    "explanation": "In a degraded state, one or more disks in the RAID array have failed or are experiencing issues, and the system operates with reduced redundancy and performance until the faulty disks are replaced. None of the other options can work in a degraded state."
  },
  {
    "ground_truth_id": 202,
    "explanation": "When some keys on the keyboard do not work and there is no physical damage, a potential cause could be a misconfiguration in the BIOS settings. Incorrect BIOS settings related to the keyboard can result in non-functional keys. Checking and adjusting the keyboard settings in the BIOS settings can help resolve the issue and restore the functionality of the affected keys. While software compatibility issues, incorrect keyboard layout settings, or outdated keyboard drivers can also cause keyboard problems, in this scenario, the BIOS settings are most likely."
  },
  {
    "ground_truth_id": 203,
    "explanation": "The boot password acts as a security measure, ensuring that only authorized users can make changes to the BIOS configuration and protecting sensitive system settings from unauthorized modification. All other options are incorrect."
  },
  {
    "ground_truth_id": 204,
    "explanation": "HSMs securely store and manage cryptographic keys, providing a high level of security for sensitive information such as encryption keys, certificates, and digital signatures. All other options and incorrect."
  },
  {
    "ground_truth_id": 205,
    "explanation": "The purpose of multithreading in computer systems is to increase parallel processing and improve performance. Multithreading enables the execution of multiple threads or tasks simultaneously, allowing for better utilization of CPU resources and faster completion of tasks. All other options are incorrect."
  },
  {
    "ground_truth_id": 206,
    "explanation": "To enable virtualization in your system, you need to access the BIOS settings and enable the “Virtualization Technology,” “Intel VT-x” (for Intel processors), or “AMD-V” (for AMD processors) option. This setting allows the CPU to support virtualization instructions. Updating the BIOS firmware may also be necessary to ensure compatibility and access to the latest features, but is not the main reason. Hardware or installed drivers are not the main reasons virtualization will not run."
  },
  {
    "ground_truth_id": 207,
    "explanation": "Advanced risk computing, such as Intel’s Advanced RISC Machines (ARM) architecture and multicore processors, offers improved performance and efficiency compared to traditional computing architectures. The use of advanced instruction sets and parallel processing allows for faster execution of tasks and more efficient resource utilization. All other options are incorrect."
  },
  {
    "ground_truth_id": 208,
    "explanation": "Intel architecture plays a crucial role in enabling high-performance computing applications. With features such as advanced instruction sets, cache hierarchy, and integrated memory controllers, Intel processors provide the performance and capabilities required for demanding computational tasks. All other options are incorrect."
  },
  {
    "ground_truth_id": 209,
    "explanation": "Multicore processors offer increased parallel processing capabilities by integrating multiple CPU cores on a single chip. This allows for the simultaneous execution of multiple threads and tasks, resulting in improved performance and faster task completion times. All other options are incorrect. Chapter 3: Hardware 143"
  },
  {
    "ground_truth_id": 210,
    "explanation": "Intel Core M processors are specifically designed for ultra-thin notebooks, tablets, and 2-in-1 detachable devices. All other options are incorrect. 3.5 Given a scenario, install or replace the appropriate power supply"
  },
  {
    "ground_truth_id": 211,
    "explanation": "Modular power supplies allow you to detach and connect only the necessary cables, minimizing cable mess inside the computer case. This improves airflow and facilitates easier maintenance and upgrades. All other options are incorrect."
  },
  {
    "ground_truth_id": 212,
    "explanation": "Installing dual power supplies with separate power sources ensures an uninterrupted power supply by providing redundant backup in the event of a power failure. Redundant power supplies do not affect storage capacity. Redundant power supplies do not enhance CPU performance. Redundant power supplies do not improve network connectivity."
  },
  {
    "ground_truth_id": 213,
    "explanation": "3.3V: Orange or yellow (typically used in motherboards, network cards, and certain digital circuits); 5V: Red (commonly used in USB ports, power supplies, and various peripherals); 12V: Yellow or blue (frequently employed in power supplies, SATA connectors, and fans). All other options are wrong."
  },
  {
    "ground_truth_id": 214,
    "explanation": "ATX motherboards commonly use a 20-pin or 24-pin power connector, which supplies power to the motherboard and its components. These motherboards are widely used in desktop computers and provide various expansion slots and features to accommodate different hardware configurations. Mini-ITX (Information Technology eXtended) motherboards are compact and designed for small form factor systems. Micro-ATX motherboards are a smaller form factor variant of ATX motherboards. ITX (Information Technology eXtended) motherboards, including both Mini-ITX and Nano-ITX variants, are designed for ultra-compact systems."
  },
  {
    "ground_truth_id": 215,
    "explanation": "The main benefit of a modular power supply is the ability to customize cable management. With modular power supplies, you can connect only the necessary cables, resulting in a cleaner and more organized system. This improves airflow, enhances aesthetics, and simplifies maintenance and upgrades. High efficiency is not the primary advantage of modular power supplies. Modular power supplies do not impact cooling performance. Modular power supplies do not provide increased power output."
  },
  {
    "ground_truth_id": 216,
    "explanation": "In North America, the standard voltage for electrical devices is in the range of 110-120 VAC (Volts AC). This voltage range is commonly used for residential and commercial applications in North America and are designed to deliver power within this range. On the other hand, in Europe and many other regions around the world, the standard voltage for electrical devices is in the range of 220-240 VAC. All other options are wrong."
  },
  {
    "ground_truth_id": 217,
    "explanation": "Redundant power supplies ensure uninterrupted power flow by utilizing backup power sources or UPS systems during outages, minimizing downtime, and preserving productivity in the office. Redundant power supplies do not increase the number of power outlets. Redundant power supplies have nothing to do with office furniture. Backup generators can provide power during outages. They are not considered redundant power supply systems. 144 Solutions"
  },
  {
    "ground_truth_id": 218,
    "explanation": "For a typical desktop computer, a power supply with a wattage rating of around 500 W is often sufficient. This should provide enough power to support the CPU, graphics card, storage drives, and other peripherals commonly found in a standard desktop setup. 300 W will not give you enough power. 750 W/1,000 W will pull more power than the standard desktop and be used by a gaming machine. 3.6 Given a scenario, deploy and configure multifunction devices/ printers and settings"
  },
  {
    "ground_truth_id": 219,
    "explanation": "The carbon paper is not aligned properly in the printer, causing the first page to print lighter. The alignment of the carbon paper in dot matrix printers is crucial for accurate and consistent printing. If the carbon paper is not aligned properly, it can result in lighter print on the first page while the subsequent pages may still be legible. All other options are incorrect."
  },
  {
    "ground_truth_id": 220,
    "explanation": "The primary corona wire charges the photosensitive drum uniformly during the charging stage. This prepares the drum for the subsequent stages of the printing process. All other options are incorrect."
  },
  {
    "ground_truth_id": 221,
    "explanation": "Laser printers utilize a laser beam or LED light source to create an electrostatic image on a photosensitive drum. They also use toner. Dot matrix printers create images by using a series of pins that strike an inked ribbon, producing dot patterns on the paper. Thermal printers use heat to activate special heat-sensitive paper, resulting in the formation of images or text. Impact printers create images by physically striking an inked ribbon against the paper, typically using a series of pins or hammers."
  },
  {
    "ground_truth_id": 222,
    "explanation": "Configuring the MFD with the IP address of an SMTP server. To use the scan-to-email functionality, the MFD needs to be set up with the IP address of an SMTP (Simple Mail Transfer Protocol) server. This server is responsible for accepting the scanned document as an attachment and delivering it as an email. Authentication may also be required by the SMTP server to ensure secure and authorized access for sending the email. All other options are incorrect."
  },
  {
    "ground_truth_id": 223,
    "explanation": "Print servers enable print sharing among multiple computers, allowing them to connect and send print jobs to a shared printer, improving printing efficiency and simplifying printer management. Devices can download print drivers from the print server. All other options are incorrect."
  },
  {
    "ground_truth_id": 224,
    "explanation": "Implementing user authentication and access control measures ensures that only authorized individuals have permission to use the printer. This can be achieved through various methods, such as requiring user login credentials or using access cards/badges to authenticate users before allowing them to print. All other options are incorrect. Chapter 3: Hardware 145"
  },
  {
    "ground_truth_id": 225,
    "explanation": "Dot matrix printers create images by using a series of pins that strike an inked ribbon, producing dot patterns on the paper. Laser printers utilize a laser beam or LED light source to create an electrostatic image on a photosensitive drum. Thermal printers use heat to activate special heat-sensitive paper, resulting in the formation of images or text. Impact printers create images by physically striking an inked ribbon against the paper, typically using a series of pins or hammers."
  },
  {
    "ground_truth_id": 226,
    "explanation": "The charging stage involves applying a uniform charge to the photosensitive drum using a corona wire. This prepares the drum for the next step in the printing process. In the exposing stage, a laser beam or LED light source is used to selectively discharge the charged areas on the drum, creating an electrostatic image of the printed content. During the developing stage, toner particles are attracted to the areas of the drum that have been discharged, forming a visible image on the drum’s surface. The transferring stage involves transferring the toner image from the drum onto the paper or another media. An electric field is applied to pull the toner from the drum onto the paper, resulting in the image being transferred. In the fusing stage, heat and pressure are applied to melt and bond the toner particles onto the paper, creating a permanent image. This is typically done using a fuser assembly that contains heated rollers. After each printing cycle, the cleaning stage ensures that any residual toner or debris is removed from the drum surface. This is important to maintain print quality and prevent contamination of subsequent printouts."
  },
  {
    "ground_truth_id": 227,
    "explanation": "Thermal printers use heat to activate special heat-sensitive paper, resulting in the formation of images or text. Laser printers utilize a laser beam or LED light source to create an electrostatic image on a photosensitive drum. They also use toner. Dot matrix printers create images by using a series of pins that strike an inked ribbon, producing dot patterns on the paper. Impact printers create images by physically striking an inked ribbon against the paper, typically using a series of pins or hammers. 10. The correct answers are A and B. Poor print quality can be caused by low ink or toner levels, which can result in faded or streaky prints. Additionally, using low-quality paper can also affect print quality, leading to smudges, bleeding ink, or a lack of sharpness in the prints. It is important to ensure both ink/toner levels and paper quality are adequate for the desired print results. The printer driver needing an update would not directly cause poor print quality. Incorrect printer settings may affect print quality, but they are not the primary cause."
  },
  {
    "ground_truth_id": 228,
    "explanation": "The toner on the paper is fused and melted into the fibers through heat and pressure during the fusing stage. This ensures that the toner becomes permanently bonded to the paper and produces a durable printout. All other options are incorrect. 12. The correct answers are A and B. The issue could be due to the top paper tray having run out of paper and documents are now being printed on more expensive labels. Additionally, selecting the wrong paper tray from the printer settings or in the print dialog can also cause the documents to be printed on labels instead of paper. The printer driver needing an update would not directly cause the issue of printing on labels instead of paper. Low ink or toner levels would not cause the issue of printing on labels instead of paper. 146 Solutions"
  },
  {
    "ground_truth_id": 229,
    "explanation": "Enable DHCP reservation. By enabling DHCP reservation, you can assign a specific IP address to the printer based on its MAC address, ensuring it always receives the same IP when connecting to the network. A static IP address does not use DHCP. Restarting the router has nothing to do with DHCP. A USB cable has nothing to do with obtaining an IP address."
  },
  {
    "ground_truth_id": 230,
    "explanation": "Configuring the MFD with the path to a suitably configured file server and shared folder. To utilize the scan-to-folder functionality using SMB, the MFD needs to be set up with the network path to a properly configured file server and shared folder. Each user must also have the necessary write permissions on the shared folder to save the scanned documents. All other options are incorrect."
  },
  {
    "ground_truth_id": 231,
    "explanation": "Uploading the scan as a file to a document storage and sharing account in the cloud. When using the scan-to-cloud feature, the scanned document is uploaded and saved as a file on a cloud-based document storage and sharing account, such as OneDrive or Dropbox. All other options are incorrect."
  },
  {
    "ground_truth_id": 232,
    "explanation": "Enabling printing only when authorized users insert a PIN ensures that users are at the printer and therefore prevents print jobs from being sent to the printer and forgotten about. All other options are incorrect. 3.7 Given a scenario, install and replace the printer consumables"
  },
  {
    "ground_truth_id": 233,
    "explanation": "The charging stage in a laser printer is performed by the corona wire. The corona wire is a thin wire located close to the photosensitive drum. It applies a uniform charge to the drum, preparing it for the subsequent stages of the printing process. All other options are incorrect."
  },
  {
    "ground_truth_id": 234,
    "explanation": "The type A USB connector is the most common and recognizable USB connector type. It is typically used for connecting printers and other peripheral devices to a computer. The type B USB connector is less common and often used for connecting devices such as scanners. The type C USB connector is a newer, more versatile connector that is becoming increasingly popular. However, it is not the standard connector used for printers. The micro-USB connector is a smaller version of the type B connector and is commonly used for mobile devices, but not typically used for printers."
  },
  {
    "ground_truth_id": 235,
    "explanation": "The wrong paper orientation is selected in the printer settings; the printed document will come out with the incorrect orientation. The printer driver is responsible for the communication between the computer and the printer, but it does not determine the paper orientation. Low ink or toner levels would not affect the paper orientation. The paper size being incorrect would result in printing on the wrong size paper, not necessarily the wrong paper orientation. Chapter 3: Hardware 147"
  },
  {
    "ground_truth_id": 236,
    "explanation": "Installing the latest printer driver compatible with Windows 10 is crucial for proper functionality. The printer driver acts as a bridge between the printer hardware and the operating system, allowing the computer to understand and send print commands to the printer. All other options may be important, but they are not the most important reasons to ensure functionality."
  },
  {
    "ground_truth_id": 237,
    "explanation": "The printers are connected to a central print server that handles wireless print jobs. In a network with multiple printers, a central print server is typically used to manage and distribute print jobs wirelessly. This server acts as an intermediary between the devices sending the print jobs and the printers themselves, ensuring efficient and organized printing across multiple devices. Setting up separate Wi-Fi networks for each printer would be impractical and inefficient. While printers may have unique IP addresses, they typically communicate with devices through a central print server or network protocols rather than direct communication. Wireless printing eliminates the need for physical connections such as USB cables."
  },
  {
    "ground_truth_id": 238,
    "explanation": "Stereolithography (SLA) is a 3D printing technology that uses liquid resin materials cured by a laser to build objects layer by layer. SLA printers offer high-resolution, detailed prints, making them a popular choice for applications requiring fine details. Fused Deposition Modeling (FDM) is a 3D printing technology that uses thermoplastic filaments, not liquid resin materials. Selective Laser Sintering (SLS) uses powdered materials, typically plastics or metals, to create 3D objects. It does not involve the use of liquid resin materials. Digital Light Processing (DLP) is another 3D printing technology that uses liquid resin materials cured by a light source, typically a digital projector. DLP operates similarly to SLA but with a different light source. 7. The correct answers are A, B, C, D, and E. They are all correct. Connect the printer to a computer acting as the print server. This computer will manage the print jobs and allow other computers to connect to the shared printer. Install printer drivers on each computer. This ensures that the computers can communicate with the printer and send print jobs. Enable printer sharing in the printer’s properties on the print server computer. This allows other computers on the network to access and use the shared printer. Access the network settings on client computers and select the shared printer. This allows the client computers to connect to the shared printer and send print jobs to it. Test the print-sharing functionality by sending a print job from a client computer. This ensures that the print-sharing setup is working correctly."
  },
  {
    "ground_truth_id": 239,
    "explanation": "Printer Control Language (PCL) is commonly used for printing text- based documents without complex formatting, such as simple word processing documents or basic office documents. PCL provides efficient and reliable printing capabilities for these types of documents. PostScript or printer-specific image enhancement technologies ensure accurate color reproduction and precise image rendering. All other options are incorrect. 148 Solutions 9. The correct answers are A, B, and E. Removing all protective tapes and packaging materials is essential to ensure that the print device is ready for use and to prevent any obstructions or damage during operation. Leave the device unboxed and powered off for a few hours to reduce risks of condensation forming within an appliance that has moved from a cold storage/transport environment to a warmer installation environment. Print devices are heavy, so make sure you use safe lifting techniques. It may require two persons to lift it safely. 10. The correct answers are A and C. Heating the extruder to a specific temperature is a common step in replacing filament in a 3D printer. By heating the extruder, the filament becomes soft and can be manually removed, allowing for easy replacement with a new filament. Pull as much of the old filament out as possible, then push the new filament through."
  },
  {
    "ground_truth_id": 240,
    "explanation": "Fused Deposition Modeling (FDM) is a 3D printing technology that uses filament materials, typically thermoplastics such as ABS or PLA. The filament is melted and extruded through a nozzle to build objects layer by layer. Stereolithography (SLA) uses liquid resin materials, not filament materials, for 3D printing. Selective Laser Sintering (SLS) involves the use of powdered materials, such as plastics or metals, rather than filaments. Digital Light Processing (DLP) also uses liquid resin materials, similar to SLA, but with a different light source for curing. It does not use filament materials."
  },
  {
    "ground_truth_id": 241,
    "explanation": "The printer creates its own Wi-Fi network for devices to connect and print wirelessly. Wi-Fi direct is a technology that allows devices to establish a direct wireless connection with each other, bypassing the need for a traditional Wi-Fi network. In the case of Wi-Fi direct printing, the printer acts as a Wi-Fi access point and creates its own network. Devices can then connect to this network and send print jobs wirelessly to the printer. Wi-Fi direct printing does not require an existing Wi-Fi network for connectivity. Wi-Fi direct printing does not use cables. Wi-Fi direct and Bluetooth are separate wireless technologies, therefore Bluetooth cannot be used."
  },
  {
    "ground_truth_id": 242,
    "explanation": "A printer maintenance kit usually contains a new fuser assembly, which is the main component of the kit. Additionally, it includes a transfer/secondary charge roller and paper transport rollers for each tray, which consist of pickup rollers and a new separation pad. These components are essential for maintaining the proper functioning of the printer. Other items such as toner cartridges, ink cartridges, printheads, and additional paper trays are not typically included in a maintenance kit. All other options are incorrect."
  },
  {
    "ground_truth_id": 243,
    "explanation": "PostScript is a page description language that excels at rendering complex graphics and images. It provides advanced capabilities for accurately representing graphical elements, including vector graphics, gradients, and shading. Printer Control Language (PCL) is commonly used for printing text-based documents without complex formatting, such as simple word processing documents or basic office documents. Chapter 4: Virtualization and Cloud Computing 149 Chapter 4: Virtualization and Cloud Computing 4.1 Summarize cloud computing concepts"
  },
  {
    "ground_truth_id": 244,
    "explanation": "Infrastructure as a Service (IaaS) is a cloud computing service model in which a Cloud Service Provider (CSP) provides the hardware but nothing else. This is ideal when you want to move desktop computers to the cloud. To do this, you would install the operating system, configure it, and patch it. All other answers are incorrect. Software as a Service (SaaS) is a model in which a vendor creates an application, such as Salesforce, and companies lease the application. Security as a Service (SECaaS) is a model in which companies provide cloud identity management services through an external source. An example of this is Okta, which can provide SAML tokens. Monitoring as a Service (MaaS) is a model in which a cloud service provider monitors your network and servers for you."
  },
  {
    "ground_truth_id": 245,
    "explanation": "With a hybrid cloud, a company has employees working in both on-premises and cloud infrastructures. It is the only cloud model that retains on-premises data centers. All other answers are incorrect. A private cloud is a single-tenant model as it is the only entity hosted in that cloud. It can also be hosted on the company’s infrastructure. A community cloud is a type of model in which companies from the same industry share resources. Public cloud models use a multi-tenant infrastructure as the CSP hosts many different companies on the same servers."
  },
  {
    "ground_truth_id": 246,
    "explanation": "Infrastructure as a Service (IaaS) provides companies with hardware, but they need to install operating systems, configure them, and patch them. All other answers are incorrect. Platform as a Service (PaaS) provides developers with the tools to create their own customized software. Software as a Service (SaaS) provides common applications on a subscription basis. Disaster Recovery as a Service (DRaaS) is needed when a massive disaster happens, such as a tornado or tsunami."
  },
  {
    "ground_truth_id": 247,
    "explanation": "Software as a Service (SaaS) provides ready-made software. An example of this is Microsoft 365 (M365), which comes equipped with various applications, including Outlook for email, as well as optional add-in applications such as GoldMine and Salesforce. All other answers are incorrect. Platform as a Service (PaaS) provides developers with the tools to create their own customized software. Infrastructure as a Service (IaaS) provides companies with hardware, but they need to install operating systems, configure them, and patch them. Monitoring as a Service (MaaS) is a type of service in which a cloud service provider monitors your network for you."
  },
  {
    "ground_truth_id": 248,
    "explanation": "A private cloud is single-tenant and ensures you have total control over all assets, including the storage and management of proprietary data. All other answers are incorrect. A hybrid cloud is a mixture of on-premises and cloud storage, meaning that not all data would be migrated to the cloud as desired. A community cloud is utilized by a group of people from the same industry sharing resources to create customized applications. A public cloud is a multi-tenant model on which multiple companies share resources and would thus not allow a single company total control of data. 150 Solutions"
  },
  {
    "ground_truth_id": 249,
    "explanation": "Metered utilization measures the resources that are being consumed by a customer so that they are only required to pay for what they use. All other answers are incorrect. Unlimited resources for free is not a cost-effective option and is not allowable by any cloud service, including metered utilization. There is no reserve pool of resources in the cloud as a CSP can increase or decrease resources at the drop of a hat. There is no restriction for critical resources; you can purchase as many resources as you require."
  },
  {
    "ground_truth_id": 250,
    "explanation": "In a community cloud model, companies within the same industry (for example, a group of law firms or hospitals) share the cost of creating and sharing resources. Each industry has its own software requirements. A private cloud is a single tenant and does not share resources, thereby allowing greater control over stored data than other cloud models. A public cloud model has a multi-tenant infrastructure in which users do not share the cost of creating resources. In a hybrid cloud, a company will both retain an on-premises environment and store some assets in the cloud."
  },
  {
    "ground_truth_id": 251,
    "explanation": "By using a Virtual Desktop Infrastructure (VDI), separate virtual desktops can be allocated to each consultant. VDI uses a pool of virtual desktops with the same configuration, thereby maintaining a consistent desktop. Since the processing of the data is done on the virtual desktop, it secures and protects it against theft. The consultants would need a very low-spec machine that runs a thin client (that is, one that uses only mouse clicks and keyboard strokes) to access it. The company therefore maintains total control of the data. All other answers are incorrect. Once data is downloaded onto a surface laptop (that is, a foreign machine), the company loses all control of the data. Terminal servers are legacy servers that used to be accessed by thin clients, but this technology is now redundant. IaaS only provides the hardware (for example, virtual desktops), but the company still needs to install the operating system and may not be able to provide a consistent desktop."
  },
  {
    "ground_truth_id": 252,
    "explanation": "With Platform as a Service (PaaS), the Cloud Service Provider (CSP) provides the application so that companies can offer their own bespoke (that is, customized) applications, such as MySQL, PHP, Azure, Oracle Database, and Google App Engine, to name a few. All other answers are incorrect. For Software as a Service (SaaS), the vendor has already created an application, for example, Office 365, Salesforce, or GoldMine. Infrastructure as a Service (IaaS) is a cloud service in which the CSP provides the hardware, such as servers, computers, switches, and firewalls. The customer then installs the software, configures it, and patches it. The private cloud is a single-tenant cloud model and would not meet this company’s requirements."
  },
  {
    "ground_truth_id": 253,
    "explanation": "The public cloud model is known as multi-tenant as the CSP hosts many different companies on the same servers. All other answers are incorrect. The private cloud model is known as single-tenant as there is only one entity hosted in that cloud. As it ensures exclusive access to resources and is isolated from everyone else, this tenant has total control of their environment. In a community cloud model, companies from the same industry share resources. The hybrid cloud is where a company has infrastructure on-premises as well as in the cloud. Chapter 4: Virtualization and Cloud Computing 151"
  },
  {
    "ground_truth_id": 254,
    "explanation": "A private cloud model would be the most appropriate purchase for this law firm as it would allow them to isolate their data entirely from all other entities as the single tenant on their host server. All other answers are incorrect. Public cloud models are multi-tenant, and there is a risk of shared tenancy, meaning that another company hosted on the same server would be able to access their data. A hybrid cloud is a model in which a company has some employees on-premises and some working from the cloud, meaning that not all company data would be migrated to the cloud. On a community cloud, companies in the same industry share both costs and resources. Like the public cloud model, this means that the law firm would not retain full control over all their migrated data."
  },
  {
    "ground_truth_id": 255,
    "explanation": "Shared resources means that the cloud provider has a pool of hardware that can be allocated to any of their customers. All other answers are incorrect. Dynamic resource allocation means that a computer or server can adjust the allocation of resources, such as CPU or RAM, according to business demands. There is no such thing as a backup pool. System sprawl means that the consumption of resources by servers exceeds the available resources in a host’s virtual environment."
  },
  {
    "ground_truth_id": 256,
    "explanation": "High availability means that a server experiences very little downtime (the five nines), and in fact, observes 99.999% uptime. All other answers are incorrect. VDI is a pool of virtual desktops. Clustering means that two servers share the same quorum disk, in which one is normally active and the other passive; that is, it is on standby waiting for the active server to fail so that it can take over. Shared resources are a pool of hardware resources in a cloud provider’s data center that are allocated to any customer that requests additional resources."
  },
  {
    "ground_truth_id": 257,
    "explanation": "Rapid elasticity would allow the toy company to instantly increase and decrease cloud resources according to demand. All other answers are incorrect. Clustering means that two servers share the same quorum disk, in which one is normally active and the other passive, meaning that it is on standby waiting for the active server to fail so that it can take over. Shared resources mean that a cloud provider has a pool of resources that they can allocate to different companies instantly. They are not reserved for any one person. Metered utilization means the CSP will produce a dashboard for a customer so that they can monitor the cost and consumption of resources, such as storage, CPU cores, and bandwidth."
  },
  {
    "ground_truth_id": 258,
    "explanation": "A company could host a private cloud on its own network, ensuring that cloud data is still available if the internet goes down. All other answers are incorrect. A community cloud allows one or more entities to share the storage cost and resources. It is maintained by a CSP and accessed via the internet. With an SaaS, a company develops an application that is leased by companies and accessed via the internet. A public cloud uses a multi-tenant infrastructure in which access to the public cloud is accessed via the internet. None of these three would permit access to cloud data if there is no internet connection. 152 Solutions"
  },
  {
    "ground_truth_id": 259,
    "explanation": "Virtual Desktop Infrastructure (VDI) is the provision of desktops. The cloud service that relates to this is Desktop as a Service (DaaS), in which the CSP offers VDI (that is, provides desktops). All other answers are incorrect. Software as a Service (SaaS) is where the vendor has already created an application (for example, Office 365, Salesforce, or GoldMine), which you use in its default format. With Platform as a Service (PaaS), the Cloud Service Provider (CSP) provides an application so that companies can provide their own bespoke (customized) applications, such as MySQL, PHP, Azure, Oracle Database, and Google App Engine, to name a few. Infrastructure as a Service (IaaS) is a type of service in which the CSP provides the hardware, such as servers, computers, switches, and firewalls. The customer then installs the software and configures and patches it."
  },
  {
    "ground_truth_id": 260,
    "explanation": "The private cloud model is known as single-tenant as only one entity is hosted in that cloud. It can also be hosted on the company’s infrastructure. All other answers are incorrect. In a hybrid cloud, a company has an on-premises environment as well as in the cloud. A community cloud hosts multiple companies from the same industry that share resources. Public cloud models are known as multi-tenant as the CSP hosts many different companies on the same servers."
  },
  {
    "ground_truth_id": 262,
    "explanation": "Virtual Desktop Infrastructure (VDI) enables separate virtual desktops to be allocated to each consultant. VDI uses a pool of virtual desktops with the same configuration, thereby maintaining a consistent desktop. Since data processing is done on the virtual desktop, the data is protected against theft. This makes it secure. The consultants would need a very low-level spec machine that runs a thin client (that is, one that uses only mouse clicks and keyboard strokes) to access it. All other answers are incorrect. SaaS is a cloud service in which a company develops an application that is leased by companies and accessed via the internet. The company does not have full control of the desktops. A Virtual Private Network (VPN) is a solution that will create a tunnel across the internet; it does not provide desktops. Remote Desktop Protocol (RDP) is a Microsoft solution for providing remote connections for an administrator to a Windows desktop or server."
  },
  {
    "ground_truth_id": 263,
    "explanation": "File synchronization is an automated advantage of cloud storage that allows the file to be shared across different devices, such as a smartphone and a tablet. All other answers are incorrect. Multiple users can simultaneously access the content. Resource exhaustion means that a computer is running out of resources such as CPU cores, RAM, or disk space. Dynamic resource allocation means that a host can be allocated resources as they are needed; it has nothing to do with cloud storage. File sharing is not an automated process; access to files is done through a mapped drive. Chapter 4: Virtualization and Cloud Computing 153"
  },
  {
    "ground_truth_id": 264,
    "explanation": "The virtual desktop is on a virtual host, and if there is no network connection, then the desktop cannot be accessed. All other answers are incorrect. In a VDI environment, nothing is copied to the local desktop. Snapshots are a much faster way to recover a guest’s machine. A Citrix connection is very fast as it is a thin client, meaning it uses only mouse clicks and keyboard strokes; this makes it an advantage. Disaster recovery being provided by the cloud provider is also an advantage."
  },
  {
    "ground_truth_id": 265,
    "explanation": "Infrastructure as a Service (IaaS) provides the hardware so that the company can move all 10 servers and 50 desktops to the cloud, though they will still need to install the operating system and configure and patch them. All other answers are incorrect. Platform as a Service (PaaS) provides developers with the tools to create their own customized software and mobile applications. Software as a Service (SaaS) provides ready-made software (for example, M365) or common applications such as GoldMine and Salesforce. Monitoring as a Service (MaaS) allows a cloud provider to continuously monitor your network and applications. None of these last three services would be appropriate for the migration described in the given scenario."
  },
  {
    "ground_truth_id": 266,
    "explanation": "Rapid elasticity enables cloud resources to be instantly increased or decreased according to demand. All other answers are incorrect. Rapid deployment describes rapid elasticity but does not exist as a concept in this exam. A load balancer controls access to an array of web servers to give the client a faster browsing experience. Metered utilization means that the CSP will produce a dashboard for a customer through which they can monitor their consumption of resources such as storage, CPU cores, and bandwidth. 4.2 Summarize aspects of client-side virtualization"
  },
  {
    "ground_truth_id": 267,
    "explanation": "A Type 1 hypervisor runs on a bare-metal virtual platform. This means that there is no operating system. Examples of this are Microsoft’s Hyper V, VMware’s ESX Server, and Citrix’s XenServer. All other answers are incorrect. Type 2 hypervisors run on software (Windows 10, for example). There are no Type 3 or 4 hypervisors."
  },
  {
    "ground_truth_id": 268,
    "explanation": "A resource pool can be created with additional RAM and CPU cores, which can be allocated to a database resource pool so that the database servers can utilize them as described in this scenario. All other answers are incorrect. System sprawl means that server consumption exceeds host resources in a virtual environment. Network segmentation only divides your network; it does not manage resources. Metered utilization is used by the cloud to charge for the consumption of additional resources."
  },
  {
    "ground_truth_id": 269,
    "explanation": "A Virtual Machine (VM) escape is a type of attack in which an attacker uses a guest virtual machine to attack either another guest virtual machine, the hypervisor, or the host. All other answers are incorrect. Pivoting is a type of attack in which an attacker gains access to a computer on a physical network and attacks another computer or server. VM sprawl means that an unmanaged virtual machine has been added to your virtual network. A snapshot is a backup of a whole virtual machine that can be rolled back when there is a problem with the virtual machine. 154 Solutions"
  },
  {
    "ground_truth_id": 270,
    "explanation": "Oracle VirtualBox runs on a type 2 hypervisor, meaning that it must sit on top of an operating system such as Windows 10. All other answers are incorrect. A type 1 hypervisor runs on a bare-metal virtual platform, meaning that there is no operating system. Examples of this include Microsoft’s Hyper-V, VMware’s ESX Server, and Citrix’s XenServer. There are no type 3 or type 5 hypervisors."
  },
  {
    "ground_truth_id": 273,
    "explanation": "Second Level Address Translation (SLAT) improves the performance of virtual memory when multiple virtual machines (guest machines) are installed. All other answers are incorrect. SLAT is not related to networking or throttling the processor. It definitely does not stop virtual memory from being used."
  },
  {
    "ground_truth_id": 274,
    "explanation": "Cross-platform virtualization means that software applications are tested with multiple operating systems, with their own resource constraints, prior to release. All other answers are incorrect. Installing applications on different versions of hypervisors is not a description of cross-platform virtualization. You cannot network sandboxes as they are isolated virtual machines. If you test applications one at a time, you are using the same operating system, not cross-platform virtualization."
  },
  {
    "ground_truth_id": 275,
    "explanation": "Bridged networking is a method by which a virtual client using a type 2 hypervisor is connected to a host virtual machine’s physical network card, allowing it to join the virtual network. Here’s a reference you can go through: https://packt.link/UosZ9. All other answers are incorrect. A Network Address Translator (NAT) hides the internal network when internal users browse the internet. An attacker would join the LAN that the host resides on, not the host itself. A virtual private network is a network that allows guest virtual machines to have their own isolated network. Chapter 4: Virtualization and Cloud Computing 155"
  },
  {
    "ground_truth_id": 277,
    "explanation": "Virtual machine sprawl is where an unmanaged virtual machine is placed on a virtual network. It poses a security risk as the unmanaged virtual machine may not be patched and an attacker could use it to gain access to your network. All other answers are incorrect. System sprawl occurs when servers overconsume host resources in a virtual environment. A sandbox is an isolated virtual machine used for testing applications and software patches and investigating malware."
  },
  {
    "ground_truth_id": 278,
    "explanation": "Fiber Channel provides a very fast connection to a Storage Area Network (SAN) and is the best choice in this scenario. A SAN uses extremely fast disks that are already configured with built-in redundancy. All other answers are incorrect. RAID 0 is neither fault tolerant nor suitable for a virtual network, though it could be used for a proxy server’s cache. A Local Area Network (LAN) is not a storage solution. RAID 5 is redundant, but Hard Disk Drives (HDDs) are too slow."
  },
  {
    "ground_truth_id": 279,
    "explanation": "Isolation means that you separate a virtual machine from the guest or another virtual machine. Here’s a reference you can go through: https://packt.link/ URHYE. All other answers are incorrect. A DMZ is a physical network that sits between the Local Area Network (LAN) and the Wide Area Network (WAN). Docker is used to separate applications from your infrastructure and is particularly useful for developers creating software. A snapshot is a backup of a virtual machine that will allow you to revert to previous settings."
  },
  {
    "ground_truth_id": 281,
    "explanation": "Virtual Technology for Directed Inputs/Output (VT-d) allows the virtual machine to access the underlying hardware that resides on the host. All other answers are incorrect. When you are preparing to run a hypervisor, you will see an option to turn on Intel VT-d in your BIOS. Here’s a reference you can go through: https://packt.link/ POvT5. Virtual Technology Extensions (VT-x) are used in x86 platforms to allow the virtual machine to access the hardware. A host machine using more than 4 GB of RAM (such as that described) is 64-bit and needs VT-d. Multi-cores allow better performance from the processors. Intel Graphics Virtual Technology (Intel GVT) provides near-native graphic performance on a virtual machine. Neither of these will resolve the current issue."
  },
  {
    "ground_truth_id": 283,
    "explanation": "One example of container virtualization is Docker. It only virtualizes the application layer and sits on top of the operating system. This makes writing applications and testing code much more efficient. All other answers are incorrect. A virtual machine backup is called a snapshot. A sandbox is used to test malware. A virtual machine escape occurs when the hypervisor, host, or guest virtual machines are attacked."
  },
  {
    "ground_truth_id": 284,
    "explanation": "Application virtualization is a process by which you can run an application from a remote server, but it has the appearance of running locally. This is great when a virtual machine does not have enough resources to run the application locally. All other answers are incorrect. A sandbox is not a live environment. It is an isolated virtual machine that tests applications and software patches and investigates malware. Installing an application locally on the virtual machine is not how one performs application virtualization. A container such as Docker is used for application development and is not part of application virtualization. Chapter 5: Hardware and Network Troubleshooting 157 Chapter 5: Hardware and Network Troubleshooting 5.1 Given a scenario, apply the best-practice methodology to resolve the problem"
  },
  {
    "ground_truth_id": 285,
    "explanation": "The first stage is to identify the problem with the printer and ignore any solution that a user gives you. After this, you will establish a possible cause, and then test the theory and implement a plan of action."
  },
  {
    "ground_truth_id": 286,
    "explanation": "The junior administrator has violated company policies. The standard operating procedure would state that any server updates should be done out of hours. They did not carry out patch management as that would be an enterprise solution. They just applied a single update to a single server. They did not communicate with users, which is a poor practice but not the main reason for the incident. Since there was no incident before they patched the server, it is not the troubleshooting process we need to look at; therefore, we can rule it out and establish a plan of action. 3. The correct answers are B and C. The first task that the support technician has is to identify the problem. They will ask the user what they did before the problem occurred and ask whether they made any changes to their laptop, for example, an operating system update. After identifying the problem, they should then back up the data before making any changes. Searching the vendor’s website is part of “establishing a plan of action,” which comes later in this process."
  },
  {
    "ground_truth_id": 287,
    "explanation": "After the incident has been resolved, the system administrator should document the findings, actions, and outcome. All other options occur before the incident has been resolved."
  },
  {
    "ground_truth_id": 288,
    "explanation": "They have just established a theory of a possible cause. They think that the cause is a recent Windows update. The next stage would be to test the theory, followed by establishing a plan of action. The problem was identified as soon as they started investigating the problem. 5.2 – Given a scenario, troubleshoot problems related to motherboards, RAM, CPU, and power 1. The correct answers are B and D. When replacing RAM, you should always power down the server and wear an electromagnetic static wrist strap. This will prevent you from damaging the RAM. Putting a machine in standby mode or trying to hot-swap RAM is not a good idea, as either could damage the RAM."
  },
  {
    "ground_truth_id": 289,
    "explanation": "Continuous beeps means that the problem is with the RAM modules or the memory controller. A motherboard problem can be either no beeps or 1 long followed by 2 short beeps. A power supply problem would have no beeps. A video adapter error can be 1 long beep followed by either 2, 3, or 4 short beeps. 158 Solutions"
  },
  {
    "ground_truth_id": 290,
    "explanation": "Before upgrading the CPU on a server, you should consult the manufacturer’s website to identify the socket type of the motherboard. Then, search to see whether that socket type can be upgraded to a faster CPU. Backing up the data, turning the power off, and wearing an electromagnetic static wrist strap should be done prior to the upgrade. 4. The correct answers are A and D. After installing memory modules, if they are not detected, check the BIOS. If they are not seen in the BIOS, the computer cannot read them; therefore, reset the memory modules to see whether they can be detected. Rebooting the computer will not help and an electromagnetic static wrist strap should be worn but does not detect RAM. 5. The correct answers are A and D. If maintenance was carried out, the storage adapter cable may have been plugged in with the wrong orientation. Although the technician can hear the fan spinning, the PSU might have a fault preventing the power good signal from being sent to the CPU. Both of these faults will prevent the computer from carrying out the Power-On Self-Test (POST). A motherboard problem can be either no beeps or 1 long followed by 2 short beeps. It is very unlikely that a computer technician will not attach a monitor when booting up a computer."
  },
  {
    "ground_truth_id": 291,
    "explanation": "The clock time on a computer uses the real-time clock that is part of the chipset to keep the time, date, and calendar accurate. The real-time clock is powered by the CMOS battery, and if the clock keeps losing time, then the battery needs to be replaced. The power from the cable to the computer does not affect the computer clock. The PSU does not power the real-time clock. Obtaining a BIOS update does not affect the real-time clock."
  },
  {
    "ground_truth_id": 292,
    "explanation": "A capacitor absorbs spikes in the direct current voltage and then can temporally store charge. If the capacitor is faulty, then it becomes swollen, and if it is not removed, it will blow and cause damage to the computer. The CMOS battery powers the real- time clock and not the capacitor. The capacitor does not store data; the hard drive stores data."
  },
  {
    "ground_truth_id": 293,
    "explanation": "Windows 10 stores keys and biometric data in the local TPM; therefore, if fingerprints are not recognized, we need to clear the TPM. Restoring a system image will not repair biometric errors. Updating the BIOS will not prevent a biometric fingerprint problem."
  },
  {
    "ground_truth_id": 294,
    "explanation": "The problem is a video adapter error. This can be 1 long beep, followed by either 2, 3, or 4 short beeps. A motherboard problem can be either no beeps or 1 long followed by 2 short beeps. It cannot be a normal post because there is an error; however, a normal post would be 1 short beep. A power supply problem would have no beeps. 10. The correct answers are A, C, and D. The first thing to check is that there is power to the wall socket. Then, replace the power cable with a known good cable. After that, plug a lamp into the power socket to ensure you get power. Changing memory will not help power issues. If there was a problem with the memory modules, a continuous beep would be heard. 11. The correct answers are A and C. This is known as the “blue screen of death” and can be caused by a serious fault – either a system memory fault, a corruption of the operating system, or a device driver fault. A motherboard problem can be either no beeps or 1 long followed by 2 short beeps. Continuous beeps mean that the problem is with the RAM modules or the memory controller. Chapter 5: Hardware and Network Troubleshooting 159 12. The correct answers are A, B, C, and D. A burning smell might occur if the CPU fan has stopped working. This will cause the CPU to overheat and the system might reboot or crash. If the heatsink that cools the CPU is not fitted properly or the thermal paste is old, then this can also cause the CPU to overheat. If the PSU is overheating, you will smell burning. If the fan vents are clogged with dust, it will stop the fan from working and cause components to overheat and you will then smell burning."
  },
  {
    "ground_truth_id": 295,
    "explanation": "A computer will perform sluggishly if there has been an incorrect configuration change. A keyboard or a mouse not plugged in will not affect a computer’s performance. A computer without a CPU will not boot up. 14. The correct answers are B and C. On an inkjet printer, a grinding noise indicates that there is a fault in the carriage mechanism. On a hard drive, any grinding or clicking indicates a mechanical problem. A healthy hard drive makes a low-level noise. A motherboard problem can be either no beeps or 1 long followed by 2 short beeps. Continuous beeps mean that the problem is with the RAM modules or the memory controller."
  },
  {
    "ground_truth_id": 296,
    "explanation": "The keyboard has dust or debris stuck under some of the keyboard keys. You should use compressed air to clean between the keys. You should never vacuum a keyboard as it could suck up any loose keys. If you use a wet cloth, you may damage the electronics underneath the keyboard. Equally, sticky keys are an accessibility feature to help disabled people use the keyboard. 5.3 – Given a scenario, troubleshoot and diagnose problems with storage drives and RAID arrays"
  },
  {
    "ground_truth_id": 297,
    "explanation": "Redundant Array of Independent Disks (RAID) 5 uses a minimum of three disks and produces a fast read speed. With RAID 5, you can lose one disk and still retain your data. RAID 0 does not provide fault tolerance or redundancy. RAID 1 is called mirroring. It uses only 2 disks, but it does not have the fast read speed that RAID 5 has; it is redundant, and you can lose one disk. RAID 6 uses a minimum of four disks. It provides fault tolerance and redundancy, as you can lose 2 disks."
  },
  {
    "ground_truth_id": 298,
    "explanation": "RAID 5 can function if only one drive fails. If you remove a healthy disk, then the RAID controller will detect a two-drive failure and you will lose all your data. Although the hardware RAID will show the failed disk in red, option C does not answer the question posed. There is a risk with RAID 5 of you removing a second disk from the array, resulting in data loss. Pulling a healthy disk out when searching for the SCSI ID will result in data loss."
  },
  {
    "ground_truth_id": 299,
    "explanation": "SMART is a Self-Monitoring, Analysis, and Reporting Technology tool that monitors the health of hard drives. When an error states that an imminent failure has been detected, then the disk is beyond repair, and you need to replace the disk. All other options are not viable. 160 Solutions"
  },
  {
    "ground_truth_id": 300,
    "explanation": "If you cannot boot from a hard drive but can see the data by using recovery software, then you should back up the data. At any time, this disk could fail. Although recovery software can access the data, it does not mean that the disk is bootable; therefore, you cannot boot from it even if you install recovery software on it. Formatting the disk will remove the data, and if the disk is not very healthy, it will not function properly."
  },
  {
    "ground_truth_id": 301,
    "explanation": "They will turn on BitLocker on the USB drive and then unlock the disk. The USB drive can now be used. An encrypted USB drive cannot be viewed in Disk Management. Turning BitLocker on in the C drive will not make encrypted data on a USB readable. Converting the USB drive into NTFS will lose all data residing on the USB drive."
  },
  {
    "ground_truth_id": 302,
    "explanation": "The SMART monitoring is reporting errors that are not there; therefore, it is malfunctioning. Disk management is functioning as we can use it to see that all disks are in a healthy state. The filesystem for corporate computers should be NTFS as it provides security. If a disk was missing from the RAID 5 set, then disk management would indicate it was either missing or in a degraded state."
  },
  {
    "ground_truth_id": 303,
    "explanation": "When a computer has a solid orange light, it indicates there is a hardware or driver problem with the hard drive. If there is a problem with the computer memory, you will hear continuous beeps. If the processor has a problem, then the computer screen will be black. If SMART monitoring has been disabled, then there will be no warning when there is a hard drive error."
  },
  {
    "ground_truth_id": 304,
    "explanation": "The first thing we should do is run the system diagnostic program that was supplied with the computer. This should reveal the cause of the extended read/write times. Launching SMART monitoring is a good idea after the system diagnostic check so that you can be notified of imminent disk failure. Swapping out the disk is premature as the system diagnostic test may find that there is a minor error. Disabling SMART monitoring is never a good idea. 9. The correct answers are B and D. When a disk is in a degraded state, that means that the disk has failed. In a RAID 5 set, one disk can fail and the data will still be available. You should immediately back up the data. You cannot format a disk in a degraded state as it has failed."
  },
  {
    "ground_truth_id": 305,
    "explanation": "When the disk that holds the operating system fails it will generate a “missing operating system” error. If there is a disk missing from a RAID set, the error will say that one of the disks is degraded. If the computer is undergoing a Windows update, it will boot and then notify you it is updating. If the CMOS battery is failing, then the date and time will be wrong."
  },
  {
    "ground_truth_id": 306,
    "explanation": "If you believe that your storage device’s performance is degraded, check the input/output operations per second (IOPS) against the manufacturer’s baseline. A solid orange light indicates that there is a hard drive failure. Disk management cannot measure the performance of a storage device. A flashing green light indicates that your hard drive is healthy. Chapter 5: Hardware and Network Troubleshooting 161 5.4 – Given a scenario, troubleshoot video, projector, and display issues"
  },
  {
    "ground_truth_id": 307,
    "explanation": "The bulb on a projector has a finite lifespan, and when is it nearing the end of its life, the bulb starts to dim. This is called a burned-out bulb. You might hear a popping sound when it fails completely. Inverters, digitizers, or display settings cannot help a burned-out bulb."
  },
  {
    "ground_truth_id": 308,
    "explanation": "If the projector is displaying a “no signal” error, either the cable is not connected properly or it is faulty and needs replacing. At this stage, the computer is not using its bulb. If the computer’s monitor is broken, it should still project the computer’s desktop. At this stage, it is too early to extend the display setting as we are not getting any signal."
  },
  {
    "ground_truth_id": 309,
    "explanation": "If the projector has a fuzzy image, then the lens needs to be rotated until the lens shows a clear picture. If the cable was defective, it would say “no signal.” The laptop display has no control over a fuzzy image. If the projector bulb needed to be replaced, then the image would be very dim."
  },
  {
    "ground_truth_id": 310,
    "explanation": "The High-bandwidth Digital Content Protection (HDCP) allows a content source (such as a DVD/Blu-ray disc) to disable itself if the display adapter and monitor and/or speaker system do not support HDCP and fail to authenticate themselves with the playback source. If the HDMI cable was faulty, then a “no signal” error would appear. The display setting does not need to be adjusted as there is output on the projector. If there was a problem with the DVD player, then there would be no sound. 5. The correct answers are C and D. If we get a “no source found” error after changing the cables to known good cables, we need to project from the laptop to the projector. If we run the displayswitch.exe command, then we have four options to project and we should choose duplicate or extend, then the laptop image will be on the computer screen. We can also complete this from the display settings on the laptop. Choose multiple displays and then choose “duplicate these displays” or “extend these displays.” There is no need to replace the projector bulb as errors are being displayed. Since the cables have just been replaced, there is no need to check the HDMI cable connection. 6. The correct answers are A and C. When using a projector from a laptop, if the connectors are not connected securely at both ends, then the screen will flicker. Flickering, flashing images or bright spots around the edges indicate that the backlight is failing. Checking the display setting or rebooting the laptop will not solve anything as it is a hardware error that is causing the problem."
  },
  {
    "ground_truth_id": 311,
    "explanation": "The HDMI-ARC allows the audio from the TV to be sent to an external sound system. If we don’t use this port, then the soundbar will not receive any audio from the TV. It is unlikely that the soundbar does not have any power. A soundbar does not have volume control; the volume is controlled by the TV remote. Video resolution has nothing to do with sound. 162 Solutions"
  },
  {
    "ground_truth_id": 312,
    "explanation": "When a monitor shows either pink or purple discoloration, it is probably caused by a faulty or loose cable. Display burn-in shows a ghost image of the previous image on the screen. The color here covers the whole screen. A faulty graphics card will show a flickering screen but, in this instance, there is no flickering screen. A burned-out bulb will cause the screen to be dim."
  },
  {
    "ground_truth_id": 313,
    "explanation": "When the cursor keeps drifting, then you need to calibrate the screen to fix it. A discolored screen would be a video cable problem. There is no mention of a graphics driver update; therefore, rolling back the driver is not an option. Changing the screen resolution will not fix this problem; it will merely change the size of the screen. 10. The correct answers are B and C. The projector is overheating, which is why it is intermittently rebooting. We would first check that the fans are working, that no dust or obstruction is stopping the fan from working, and that the air vents are free from dust or obstruction. You might check that the power cable is plugged in properly, but you should not change the cable at this time. The projector display resolution is not the cause of a reboot."
  },
  {
    "ground_truth_id": 314,
    "explanation": "Display burn-in is where the previous image remains on the screen or is shown as a ghost image. Dead pixels are where the screen may freeze, and black areas might be visible. A faulty cable would flicker. The laptop freezing could end up with a “no-signal” error."
  },
  {
    "ground_truth_id": 315,
    "explanation": "Testing the output resolution is primarily done to ensure that the system’s output is compatible with a variety of display devices. Display devices can have different resolutions and capabilities, and testing helps confirm that the system can adapt to and function properly with these devices. It ensures that the output is correctly scaled, aligned, and compatible, avoiding issues such as distorted images or cut-off content. The accuracy of color representation and optimization of image quality are secondary considerations, but the main focus is on compatibility with various display devices. It does not enhance system performance."
  },
  {
    "ground_truth_id": 316,
    "explanation": "The display settings is the correct answer as the display settings often include options for touch-screen calibration and enabling touch input. The battery status is incorrect as the battery status does not have a direct impact on touch-screen functionality. The network connection is incorrect as the network connection does not affect touch-screen functionality. The keyboard settings is incorrect as keyboard settings do not directly relate to touch-screen functionality. 5.5 – Given a scenario, troubleshoot common issues with mobile devices"
  },
  {
    "ground_truth_id": 317,
    "explanation": "The CMOS battery is the correct answer as a faulty or depleted CMOS battery can cause issues with the computer’s ability to retain BIOS settings, leading to POST errors. RAM modules will emit continuous beeping noises. Issues with the hard drive will typically result in boot errors or an inability to access data, but not directly affect the POST process. Graphics card issues may cause display-related problems, but they do not directly impact the POST process. Chapter 5: Hardware and Network Troubleshooting 163"
  },
  {
    "ground_truth_id": 318,
    "explanation": "A PoE injector can supply power to the network device through the Ethernet cable, resolving the power-related problem. Checking cable connections can help resolve physical connectivity issues but will not provide power to the network device. Resetting network settings would not provide power to the device and may not address the power-related issue. Restarting a network device will not resolve the power issue."
  },
  {
    "ground_truth_id": 319,
    "explanation": "The phone’s battery is defective when the phone is getting excessively hot. Running resource-intensive apps may cause some heat, but excessive heat is more likely due to a defective battery. Exposure to direct sunlight can cause some heat, but it is unlikely to result in excessive heating. An outdated operating system can cause performance issues, but it is not directly related to excessive heat."
  },
  {
    "ground_truth_id": 320,
    "explanation": "If your phone has liquid damage, you need a professional repair service to repair the phone. Turning on the phone when it has been exposed to liquid can potentially cause short circuits and further damage. Although using rice to absorb moisture is a common suggestion, it is not an effective solution for fully drying the internal components of a phone. Using a hairdryer can introduce heat, which may further damage the phone’s internal components. 5.6 – Given a scenario, troubleshoot and resolve printer issues"
  },
  {
    "ground_truth_id": 321,
    "explanation": "Duplex printing automatically prints on both sides of the paper. The printing speed of a printer does not necessarily affect paper usage. The type of paper used (recycled or not) does not directly impact the paper usage of a printer. A larger paper tray may reduce the frequency of paper refills but does not address the issue of excessive paper usage itself."
  },
  {
    "ground_truth_id": 322,
    "explanation": "The printer’s fuser unit is not functioning properly as it fused the text to the paper. Low-quality ink cartridges may affect the print quality, but they are unlikely to cause the printed text to not stick to the paper. Using incompatible paper might affect the print quality but will not be the cause of this problem. The printer’s temperature settings are not adjustable but are based on the specific printing requirements."
  },
  {
    "ground_truth_id": 323,
    "explanation": "The printer’s duplex unit is not properly set up. You need to read the manufacturer’s leaflet that comes with instructions on how to set it up. Firmware updates are unlikely to resolve a hardware-specific issue related to the duplex unit. The alignment of the paper tray does not directly affect the functioning of the duplex unit. Low ink levels will not affect the printer’s ability to perform double-sided printing. 4. The correct answers are B and C. The printer’s drum unit is damaged, or it has dirty feed rollers. Firmware updates generally do not directly relate to the print quality. Low ink levels may affect the print quality, but not marks on the paper."
  },
  {
    "ground_truth_id": 324,
    "explanation": "The paper is too thick for the printer because printers have specific paper weight and thickness limitations, which is why it is failing to feed into the printer. If the paper tray was empty, the printer would not attempt to feed any paper in the first place. Low ink cartridges do not directly affect paper feeding in a printer. Outdated printer drivers can cause various issues, such as printing errors, but not issues with the paper feed. 164 Solutions"
  },
  {
    "ground_truth_id": 325,
    "explanation": "The most likely cause of a paper jam is any foreign objects or obstructions present in the paper path, such as small pieces of torn paper or debris. These can cause the paper to jam when it is fed through the printer. While an empty paper tray can prevent the printer from feeding paper, it will not cause a jam. While wrinkled or folded paper can cause paper-feed issues, this is not the most likely cause of a paper jam. Low ink cartridges do not directly cause paper jams."
  },
  {
    "ground_truth_id": 326,
    "explanation": "Implementing a login requirement for print jobs allows better control over print resources. Users must authenticate themselves before their print jobs are processed, reducing the likelihood of abandoned or unnecessary printouts, and thus minimizing paper waste. Loading a large stack of paper may lead to increased paper usage and the potential for unnecessary prints, depending on user behavior. While printing double-sided documents can help reduce paper waste, it does not specifically address the need for print job control. Manually feeding paper instead of utilizing paper trays may not be practical for larger print jobs, and it does not directly address the issue of print job control."
  },
  {
    "ground_truth_id": 327,
    "explanation": "The failure of air conditioning can lead to blank spots or missing text on thermal paper due to the print head overheating or improper contact with the paper. To resolve this issue, it is important to clean the print head to remove any dust or debris and ensure that the print head has proper contact with the paper for consistent printing. Overheating and damage to the print head do not address the specific issue of blank spots or missing text. The failure of air conditioning does not directly cause a decreased print speed or slower output in a thermal printer. Thermal printers do not use ink cartridges."
  },
  {
    "ground_truth_id": 328,
    "explanation": "A dirty air filter restricts airflow, causing the projector to overheat. To prevent damage, projectors power down automatically when overheating occurs. An insufficient power supply doesn’t directly cause unexpected power downs during operation. A malfunctioning lamp can cause issues, but it’s not the most likely cause of unexpected power- downs. A loose connection can cause problems, but it doesn’t directly lead to unexpected power downs during operation."
  },
  {
    "ground_truth_id": 329,
    "explanation": "Blank receipts may be printed due to paper feed issues or incorrect paper loading in the printer. Empty ink or toner cartridges can cause other printing issues, but they are not the most likely cause of blank receipts. Overheating of the print head is not directly associated with printing blank receipts. Outdated printer driver software can cause various issues, but it is not the most likely cause of blank receipts."
  },
  {
    "ground_truth_id": 330,
    "explanation": "The ribbon in a dot matrix printer contains ink-soaked fabric or polymer material that strikes against the paper, forming characters or images through impact printing. Inkjet printers use liquid ink cartridges or tanks, not ribbons, to produce printed output. Laser printers use toner cartridges that contain powdered ink, not ribbons. Thermal printers use heat-sensitive paper and do not require ribbons. Chapter 5: Hardware and Network Troubleshooting 165"
  },
  {
    "ground_truth_id": 331,
    "explanation": "When the ribbon becomes worn, it may not transfer ink properly to certain areas of the paper, leading to gaps and missing words in the output. Paper feed issues or misalignment results in skewed prints or paper jams rather than missing words. Overheating will generally affect the overall print quality or lead to other issues, but not specifically missing words. Outdated printer driver software can cause various printing issues, but it is not the most likely cause of missing words."
  },
  {
    "ground_truth_id": 332,
    "explanation": "Excessive heat can damage the print head and lead to poor print quality. Cold print heads will not allow the ink to flow. Maintaining an optimal temperature is crucial to prevent both overheating and clogging problems. Increased temperature can slow down printing. Excessive heat can increase the risk of printer malfunctions but is not the most important factor."
  },
  {
    "ground_truth_id": 333,
    "explanation": "Incorrect label alignment or positioning can cause gaps on printed labels. Gaps on printed labels are typically not related to low ink or toner levels. A paper jam will cause gaps on labels and outdated printer drivers or firmware can cause various printing problems, but gaps on labels are typically related to alignment or positioning."
  },
  {
    "ground_truth_id": 334,
    "explanation": "If the drum is not properly cleaned or has physical damage, it can retain remnants of the previous image, causing a faint duplicate to appear on subsequent printouts. An insufficient fuser temperature typically causes issues such as toner smearing or incomplete bonding, but it does not directly relate to the appearance of a ghost image on the printed page. Low toner levels may result in faded or light printouts. A loose connection between the printer and the computer may lead to communication issues or prevent print jobs from being processed."
  },
  {
    "ground_truth_id": 335,
    "explanation": "If the paper gets stuck to the fuser in a newly installed printer, it is best to contact the printer manufacturer or a technician for assistance. They can provide guidance specific to your printer model and help resolve the issue without causing further damage. Using tweezers or pliers could potentially damage the fuser or other printer components, so it is not recommended. If the paper gets stuck to the fuser in a newly installed printer, turn off the printer and allow it to cool down. Instead of removing the paper yourself, consult the printer’s manual or contact the manufacturer for specific instructions. It can provide guidance or recommend contacting a technician to avoid potential damage. Ignoring the problem and continuing to print can lead to additional paper jams or even damage to the printer."
  },
  {
    "ground_truth_id": 336,
    "explanation": "Using an incompatible (third-party) toner can lead to poor print quality and specifically cause lines to appear on copied pages. A clogged printer head can result in inconsistent or distorted prints on both copied and directly printed pages. An overheated fuser would generally affect both copied and directly printed pages, rather than only causing lines on copied pages. Damaged scanning glass would typically result in inconsistent or distorted images on both copied and directly printed pages. 166 Solutions"
  },
  {
    "ground_truth_id": 337,
    "explanation": "Updating the printer drivers or firmware to the latest version can help resolve the issue. Low ink or toner levels will typically result in faded prints or incomplete text, rather than garbled text. Damaged printer cables or connections could potentially cause printing problems, but not garbled text. Incorrect printer settings or font compatibility can cause printing issues, but they are more likely due to outdated printer drivers or firmware."
  },
  {
    "ground_truth_id": 338,
    "explanation": "Flatbed scanners are commonly used for digitizing a large number of printed documents efficiently and accurately. NFC devices are primarily used for card payments. While a digital camera can capture images, it is not the most suitable or efficient method for capturing electronic images of a large collection of historical handwritten documents. QR scanners are specifically designed for scanning QR codes."
  },
  {
    "ground_truth_id": 339,
    "explanation": "Dust or debris on the imaging drum can cause a consistent line from top to bottom on every sheet. Cleaning the imaging drum using appropriate cleaning methods can often resolve the issue. Low ink or toner levels typically result in faded prints or incomplete text, rather than a consistent line from top to bottom. While a malfunctioning paper feed mechanism can cause various printing problems, it wouldn’t cause a single line to be consistently printed from top to bottom on every sheet. A consistent line from top to bottom is not a common symptom of outdated drivers or firmware."
  },
  {
    "ground_truth_id": 340,
    "explanation": "A grinding noise during printing is commonly associated with a paper jam or obstruction. Low ink or toner levels typically do not result in a grinding noise. A grinding noise is not typically related to driver or firmware issues. Network connectivity issues do not typically result in a grinding noise. 5.7 – Given a scenario, troubleshoot problems with wired and wireless networks"
  },
  {
    "ground_truth_id": 341,
    "explanation": "Interference can disrupt the wireless signal and limit your ability to choose an optimal channel. Outdated firmware will not limit your ability to choose an optimal channel. Incorrect network configuration settings do not directly affect the ability to choose a specific channel for the router. Insufficient signal strength may lead to connectivity problems, but it does not directly affect the ability to choose a specific channel for the router."
  },
  {
    "ground_truth_id": 342,
    "explanation": "Incorrectly entering a MAC address in the filter list can result in devices that should be blocked being able to connect to the network. Outdated firmware on the wireless router is not related to MAC filtering. Interference from neighboring wireless networks does not affect MAC filtering. Incompatible wireless encryption protocols are not directly related to the MAC filtering functionality."
  },
  {
    "ground_truth_id": 343,
    "explanation": "The client should release its current IP address and request a new one from the network’s DHCP server. It is unlikely that the network card has a driver problem. Changing the wireless channel on the router will not resolve the issue. Flushing the DNS cache will not resolve the issue. Chapter 5: Hardware and Network Troubleshooting 167"
  },
  {
    "ground_truth_id": 344,
    "explanation": "The licensed band is exclusively allocated to authorized users with specific licenses, ensuring controlled and interference-free operation. The licensed band requires authorization and is not available for unrestricted public use. The licensed band is not designated for temporary or experimental use; it is reserved for authorized users. The licensed band requires specific licenses; therefore, any unlicensed option is incorrect."
  },
  {
    "ground_truth_id": 345,
    "explanation": "Configure each router on different non-overlapping channels, each with its own IP address range, minimizing interference and optimizing performance. Channel bonding increases bandwidth but will increase interference and worsen latency issues. Since we want a wireless network, we will not be using cable connections. QoS can help manage network traffic, but it may not directly address latency issues."
  },
  {
    "ground_truth_id": 346,
    "explanation": "A VPN establishes a secure and encrypted connection between the remote device and the company LAN, ensuring data privacy and security during remote access. Enhancing the internet speed does not create a secure connection. Firewalls are separate security measures that control network traffic and protect against unauthorized access; they don’t create a secure connection."
  },
  {
    "ground_truth_id": 347,
    "explanation": "Relocate the wireless router. Moving the router to a central location improves the signal coverage and reduces device interference and connection drops. Upgrading the bandwidth doesn’t directly address the dropping connection issue. Completely disabling other devices may not be feasible in an office environment. Changing encryption enhances security, but it may not resolve the dropping connection problem directly."
  },
  {
    "ground_truth_id": 348,
    "explanation": "A Wi-Fi analyzer helps identify sources of signal interference, such as overlapping channels or nearby devices, aiding in troubleshooting wireless connectivity issues. A Wi-Fi analyzer’s primary purpose is to identify and troubleshoot connectivity issues rather than directly increasing speed. Changing the Wi-Fi password is a security measure but is not directly related to troubleshooting connectivity issues. Expanding coverage requires additional hardware or configuration changes, which are beyond the scope of a Wi-Fi analyzer’s capabilities for troubleshooting."
  },
  {
    "ground_truth_id": 349,
    "explanation": "Poor VoIP quality can occur when there is not enough available bandwidth to support voice data transmission, leading to audio quality issues. Outdated hardware is not directly linked to poor VoIP quality. A low battery will not affect poor VoIP quality. 168 Solutions Mock Exam"
  },
  {
    "ground_truth_id": 350,
    "explanation": "M.2 allows faster data transfer rates compared to traditional hard drives. M.2 is a form factor that is commonly used for solid-state drives (SSDs) and offers faster data transfer speeds than traditional hard drives. M.2 supports both SATA and PCIe interfaces. Graphics cards typically use the PCIe form factor. M.2 can be used as a boot device."
  },
  {
    "ground_truth_id": 351,
    "explanation": "RAID 5 requires a minimum of three drives and distributes data and parity across multiple drives to provide fault tolerance. RAID 6 provides a higher level of fault tolerance with dual parity. RAID 0 offers increased read performance due to data striping without redundancy. RAID 5 does not require dedicated parity drives."
  },
  {
    "ground_truth_id": 352,
    "explanation": "Secure Digital (SD) is commonly used in digital cameras. SD cards are widely adopted and offer varying capacities for storing photos and videos. CompactFlash (CF) was popular in the past, but it has been largely replaced by SD cards. Memory Stick (MS) is primarily used by Sony devices. eXtreme Digital (xD) cards are less common and are used in older Olympus and Fujifilm cameras."
  },
  {
    "ground_truth_id": 353,
    "explanation": "ATX motherboards support dual-channel memory architecture. Dual- channel memory allows for increased memory bandwidth and improved system performance. ATX motherboards support both Intel and AMD processors. ATX motherboards typically have more expansion slots than microATX. Modern ATX motherboards use the 24-pin ATX power connector."
  },
  {
    "ground_truth_id": 354,
    "explanation": "Secure Boot is a security feature provided by UEFI. Secure Boot ensures that only trusted operating system bootloaders and drivers are loaded during system startup. Although a BIOS password is a security feature, it is not specific to UEFI. The CMOS clear jumper is not a security feature provided by UEFI. TPM is a separate hardware component that provides secure storage and cryptographic functions (such as encryption and digital signatures) to enhance overall system security."
  },
  {
    "ground_truth_id": 355,
    "explanation": "Enhanced audio quality and capabilities. An expansion sound card enhances the audio output of a computer by providing dedicated audio processing and additional audio ports. This results in better sound quality and the ability to support advanced audio features. An expansion sound card does not directly affect CPU performance. Cooling efficiency is related to cooling fans and heat sinks, not sound cards. An expansion sound card is not related to storage capacity."
  },
  {
    "ground_truth_id": 356,
    "explanation": "To regulate the temperature of components. Cooling fans are used to circulate air within a computer system, dissipating heat generated by components such as the CPU, GPU, and power supply. This helps prevent overheating and ensures optimal performance and longevity of the hardware. Display resolution is unrelated to cooling fans. Wireless connectivity is achieved through other components, such as network adapters. Cooling fans do not impact sound quality."
  }
]